[
  {
    "id": "2870572006413185256",
    "title": "Microsoft Word - IO1_A1_Transfer of knowledge about basic of 3D printing concepts to the VET teachers - ShortVersion - NewTemplate.docx",
    "content": " \t\t\nIO1 – Methodology for defining 3D printing exercises suitable for transversal education    3D PRINTING TECHNICAL GUIDE - SUMMARY -    - O1A1- Transfer of knowledge about basics of 3D printing concepts to the VET teachers.  \n\n \n2  \nERASMUS3D+ For the immersion in 3D printing of VET centres.  Project Agreement Number  2017-1-DE02-KA202-004159  This work is licensed under  https://creativecommons.org/licenses/by-nc-nd/4.0/   PARTICIPANT ORGANIZATIONS      Disclaimer:  \"The European Commission support for the production of this publication does not constitute an endorsement of the contents which reflects the views only of the authors, and the Commission cannot be held responsible for any use which may be made of the information contained therein.\"   Output Identification O1 Output Title IO1 – Methodology for defining 3D printing exercises suitable for transversal education Output Description O1 – A1.  Transfer of knowledge about basic of 3D printing concepts to the VET teachers. Version v.1.1 (Short Version) \t\t\t\n\n\n \n3  \nINDEX SCHEMES INDEX............................................................................................................................... 4 TABLES INDEX .................................................................................................................................. 4 1. INTRODUCTION TO ADDITIVE MANUFACTURING. .................................................................... 5 1.1 What is Additive Manufacturing?...................................................................................... 5 1.2 How does 3D printing work? ............................................................................................. 5 1.3 What is Rapid Prototyping? .............................................................................................. 6 2. FUSED DEPOSITION MODELING (FDM). .................................................................................... 7 3. PRODUCTION PROCESS IN 3D PRINTING ................................................................................... 8 3.1. Obtaining the digital model: ............................................................................................. 9 3.2. Exporting and repairing the STL file:................................................................................ 10 3.3. Testing, orientation, distribution and G-Code: ................................................................ 10 3.1.1. Analyzing the piece or model: ................................................................................. 10 3.1.2. Support structures: ................................................................................................. 11 3.1.3. Model infill: ............................................................................................................ 12 3.1.4. Positioning and orientation ..................................................................................... 12 3.1.5. Generating the G-Code. .......................................................................................... 13 3.4. 3D printing: .................................................................................................................... 14 3.5. Extracting pieces: ........................................................................................................... 14 3.6. Post-processing: ............................................................................................................. 15 4. SOFTWARE THAT YOU NEED FOR 3D PRINTING ...................................................................... 16 4.1 Programmes for designing .............................................................................................. 16 4.2 Programmes for testing, orientating and repairing.......................................................... 17 4.3 Programmes for generating the G-code .......................................................................... 18 4.4 3D Printing Workflow ..................................................................................................... 18 5. 3D PRINTING MATERIALS ....................................................................................................... 19 5.1 Overview ........................................................................................................................ 19 5.2 FDM 3D Printing Materials .............................................................................................. 19 6. LIMITATIONS OF PRINTED OBJECTS. ....................................................................................... 20 6.1 Limitations of additive manufacturing and 3D printing. ................................................... 20 6.2 FDM limitations table. .................................................................................................... 21 6.3 Introduction to the limitations of FDM technology. ........................................................ 22 7. EXAMPLE................................................................................................................................ 24  \n\n \n4  \nFIGURE INDEX Figure 1: 3D printing process. ........................................................................................................... 6 Figure 2: FDM Technology................................................................................................................ 7 Figure 3: Support structures. .......................................................................................................... 11 Figure 4: Different types of support structures. .............................................................................. 12 Figure 5: Different infill percentages and patterns.......................................................................... 12 Figure 6: Two different layer heights. ............................................................................................. 14 Figure 7: Extraction. ....................................................................................................................... 15 Figure 8: Mechanical process and bath for removing the support structures. ................................. 15 Figure 9: Different finishing. ........................................................................................................... 16 Figure 10: Process to develop a 3D Model. ..................................................................................... 16 Figure 11. Diagram 3D Printing Workflow. ..................................................................................... 18 Figure 13: Digital model, result of the 3D scanning. ........................................................................ 25 Figure 14: Positioning the model in Meshmixer. ............................................................................. 25 Figure 15: General analysis in Meshmixer. ..................................................................................... 26 Figure 16: Jaw with repaired holes and defects. ............................................................................. 27 Figure 17: Model loaded and configuration and parameters of the model in Cura. ......................... 27 Figure 18: Jaw printing sequence.] ................................................................................................. 28 Figure 19: Final result. .................................................................................................................... 29  SCHEMES INDEX Scheme 1: Processes and manufacturing techniques........................................................................ 5 Scheme 2: Production process in 3D printing ................................................................................... 9   TABLES INDEX Table 1: Software to Designing a 3D Model .................................................................................... 17 Table 2: Software to Testing, Orientating and Repair a 3D Model ................................................... 18 Table 3: Comparative table. ........................................................................................................... 22                  \n\n \n5  \n1. INTRODUCTION TO ADDITIVE MANUFACTURING.  1.1 What is Additive Manufacturing? Additive manufacturing or 3D printing (commonly called) is a process that creates a physical object from a digital design. There are different 3D printing technologies and materials you can print with, but all are based on the same principle: a digital model is turned into a solid three-dimensional physical object by adding material layer by layer. [1] It is important to point out from the beginning that Additive Manufacturing does not constitute a single technology but a set of manufacturing processes, very different from each other, that share three common characteristics: 1. They are manufacturing processes by addition of material to construct a solid three-dimensional object.  2. The object is constructed by superimposing successive layers of material. 3. The object is made from a digital 3D model.  They are called ADITIVE Manufacturing processes to differentiate them from conventional processes. Together with these, they are part of the set of processes available to the Industry.  Some of the most used additive manufacturing technologies that best suits to the educational area will be described in the following point of this guide. These technologies are: Fused Deposition Modeling (FDM), Stereolithography (SLA) and Selective Laser Sintering (SLS).    1.2 How does 3D printing work? It all starts with making or obtaining a virtual design of the object you want to create. This virtual design can be made in a CAD (Computer Aided Design) file using a 3D modeling program (for the creation of a totally new object) or with the use of a 3D scanner (to copy an existing object). A 3D scanner makes a 3D digital copy of an object.  There are also lots of online file repositories where you can download existing 3D files that will help get you started. \nPROCESSES AND MANUFACTURING TECHNIQUES\nSubtractive Manufacturing. \nForming Process (SPF)\nAdditive Manufacturing\nJoining process\nScheme 1: Processes and manufacturing techniques. [2] \n\n \n6  \nThe 3D printing process turns an object into many, tiny little slices, then builds it from the bottom up, slice by slice. The layers then build up to form a solid object. [3] \nSome advantages of Additive Manufacturing compared to conventional processes: • Fewer steps between the CAD model and the production of the part. • Generally, few human resource requirements due to a high level of automation. • A large number of geometrical forms can be manufactured, enabling for instance the production of parts which are topologically optimized, with internal channels, etc. • High-speed manufacturing for small, complex parts. • Generally, less material wastage. • Possibility to reconstruct damaged sections of existing objects, depending on the part material • No special tooling required.  1.3 What is Rapid Prototyping? Rapid prototyping is an automated process that quickly builds physical prototypes from 3D CAD files composed of surface quality or solid models. Any manufacturing process can be classified as either subtractive, formative or additive. Every manufacturing process either falls completely into one of these categories, or is a hybrid process falling into more than one. In the manufacturing arena, productivity is achieved by guiding a product from concept to market quickly and inexpensively. Rapid prototyping technology aids this process. [5] It is important not to confuse rapid prototyping with 3D printing or with additive manufacturing, because the concepts are used interchangeably and wrongly many times. We can say that additive manufacturing is one of the technologies with which we can produce a rapid prototyping product.  It is convenient to underline that every technology and every process has a starting point in common: computer aided design (CAD).   DesignSTL fileOBJ file...\nG-Code\n3D Print\n3D Object\nFigure 1: 3D printing process. [4] \n\n \n7  \n2. FUSED DEPOSITION MODELING (FDM). Home printers typically work with plastic filament. The technology behind this is often referred to Fused Deposition Modeling (FDM) is a 3D printing technology that works by extruding a thermoplastic polymer through a heated nozzle which gets deposited on a building stage. FDM is also considered to be a form of additive manufacturing, which at the same time is a “process of joining materials to make objects from 3D model data, usually layer upon layer”.  The mere process involves a plastic filament which is fed by a spool to the nozzle where the material is liquefied and “drawn” on the platform. As soon as it touches the build stage, the filament hardens while being gradually deposited, following a certain structure, in order to create the final 3D print. When a layer is drawn, the platform lowers by one-layer thickness so that the printer is able to start working on the next layer.  \n  There are many different materials which can be used with FDM. The most commonly used are ABS (Acrylonitrile Butadiene Styrene), PLA (Polylactic Acid) and Nylon (Polyamide), but other exotic varieties of materials can also be used, like a material blend of plastic and wood or carbon. [7] Because this technology presents some very good pros, FDM is often used in the area of non-functional prototypes in order to produce concept parts, functional models, prototypes in general, manufacturing tooling and modeling, and end use parts. More specifically, FDM can be used for low-volume production and prototypes aimed at form, fit and function tests.  At the same time, it is most commonly used in the aerospace sector, for example, to produce wind turbines. Anatomical models for medical use are also very much suitable to be built with this technology. Finally, FDM has slowly been enabling the rapid prototyping of biomedical micro devices, the kind of devices that are used on a daily basis in hospitals, for example, therefore very much fundamental, as it is considered both cheap, but at the same very safe. [8] When it comes to 3D printing technology, one of the very first concerns relate to its cost. While in general it is the long-term use of materials that can become a serious expense, \nFigure 2: FDM Technology [6] \n\n \n8  \nthose who want to engage with Fused Deposition Modeling have an advantage from the start; in fact, FDM printing machines are among the cheapest and most affordable especially for those who want to use it in a domestic environment. [9] As for accuracy, the 3D prints do not reach the same level of accuracy and quality of other items which are instead produced through the use of Stereolithography. That said, the result is considered to be fairly qualitative, depending on the sector where the technology is applied. Resolution depends mainly on the size of the nozzle that is used. The precision of the machine is dependent on the extruder movements on the X and Y axis, but there are other factors to be taken into consideration. For example, the bonding force between the layers is lower than in the Stereolithography process. Consequently, the weight of the layers might squeeze the lower layers, which can therefore influence and even compromise the quality of the 3D print. [10]    3. PRODUCTION PROCESS IN 3D PRINTING Hereunder, in this chapter, all the necessary processes and steps for, starting with a digital design, obtaining a real printed piece, are going to be described. It is important to mention that there is not just a single valid process for printing three dimensional pieces. What is explained in this guide are a certain number of steps that should be adapted to the type of piece, selected technology, type of machine, and even to the used software. Furthermore, the process that is described hereunder is mostly intended for fused deposition modelling (FDM) 3D printers. In the production process for 3D printing, experience, piece features, used machine, etc. have a lot of weight. It is for sure that someone with little or without experience will 3D print a lot of piece with failures, before he finds the key. The production process, in a generally speaking, is the following: \n\n \n9  \n 3.1. Obtaining the digital model: There are several possibilities for obtaining the 3D model or digital model that is wanted to print. In particular, there are three possibilities: • To model the piece using a CAD software: With this first option, in order to get the three-dimensional model, a computer aided design (CAD) software must be used. There are a lot of available CAD software for modelling, and there is not a best option; it will depend on the user and their abilities with the software.  • To obtain the geometry by Reverse Engineering and 3D scanners: By this option a 3D scanner is used to digitally obtain the geometry of a real object. This is not a simple process and some ability and experience is required. In addition, there are several types of 3D scanners, and they are usually expensive. The reverse engineering process usually is for copying, improving, or customizing real objects, or also for incorporating complex surfaces to a 3D modelled piece.  • Downloading the model from repositories or asking someone to design it for you: If you do not have knowledge in computer-aided 3D design, or you do not have the necessary equipment (or software, or even knowledge) for applying a process of reverse engineering, to download the model from a repository or to ask somebody to design it for you is the best option. Depending on whether the repository is a 3D printing model repository (e.g.: Thingiverse) or a more general digital model repository (e.g.: GrabCAD), the downloaded model will be ready for 3D printing or it will be not. \nScheme 2: Production process in 3D printing [11] \n\n \n10  \nIn the next tutorial it can be seen a range of CAD design tips for 3D printing, depending on the material selected: https://www.sculpteo.com/en/materials/materials-design-guidelines/ And in the next link it can be found more information and more tutorials about how modelling and preparing a piece for being 3D printed by different CAD software: https://www.sculpteo.com/en/tutorial/  3.2. Exporting and repairing the STL file: When you work designing and printing 3D models, a wide range of formats or types of files are available. Some of them are thought for designing or scanning, but others are associated to 3D printing, such as: STL, OBJ, PLY or FBX, among others. Depending on the modelled piece, on the software, on the 3D printer features, etc., one or another format must be used. In this guide, in order to unify criteria, it is explained how to export and use the STL file. When the piece is designed and modelled, a format conversion to the \".stl\" file is needed. If the piece has been downloaded from a repository, this conversion is frequently already done. However, if free or commercial CAD software has been used this conversion is needed. Normally, exporting a CAD design to STL format is as simple as going to the used software menu and clicking on \"Save as...\" or in \"Export\" and choosing STL. Sometimes, there are problems during conversion to STL, either because the model is not thought for 3D printing, either because the design in the CAD software has not being made correctly, or either other causes. So, the exported model may have some errors. These errors are of various kinds: holes or gaps, reversed triangles, duplicated faces or triangles, faces or triangles that intersect, singular points or faces (out of the model), etc. The digital model reparation is explained in the next step of the production process in 3D printing, because it is very linked to the implementation of analysis to the pieces.  3.3. Testing, orientation, distribution and G-Code: This stage of the production process in 3D printing is about the preparation of the pieces or digital models (previously exported to STL) for being 3D printed. It is about performing the next process, orderly:  3.1.1. Analyzing the piece or model: The analysis usually is necessary when pieces are relatively complex, or when the origin of the pieces is not known, or it can be done just if you want to be one hundred per cent that the piece is suitable for being 3D printing. In addition, a good analysis can detect errors in the triangle mesh arisen from the STL conversion. These analysis can be implemented by some software, that also is useful for other purposes or not. Implemented analysis of: - Thickness: Recommended thickness depends on the 3D printing machine (and frequently on the used technology). Some machines allow to bigger thickness than others. To search the specific machine and to see the allowed thickness should be enough. Generally speaking, for fused deposition modelling (FDM) machines, \n\n \n11  \nthickness about 1 millimetre should be considered, approximately. This parameter must not be confused with layer thickness. - Holes or gaps: The model want to be printed must be perfectly closed, or best said: it must be watertight. This means that the triangular mesh must not have holes or gaps, or what is the same, it must not have vertex or triangle points not joined; every of them must be connected to other triangles. - Angles and overhang:  By this analysis it can be found, depending on the selected technology and machine, if the model or piece will need of support structures for being printed. Generally, for FDM printers the minimum allowed inclination angle is 45 degrees. Finally, it is noticeable that many of the used programs for analysing the piece allow, not just to detect errors or problems, but also allow to repair, or what is best, auto repair the model.  3.1.2. Support structures: For some technologies, it is necessary that, in order to beat gravity and to print overhang parts (or with internal gaps), support structures are inserted on this zones. They are usually necessary from 45 degrees (for FDM printers).   Figure 3: Support structures. [12] Support structures are usually done by the same material as the piece, although there are 3D printers that print two materials: piece's one and support structures one. With these printers soluble support materials in certain liquids can be used. As support structures are thought just for holding the first layers of the model that are cantilevered or \"floating\", support structures are built lightly and using less material than for the piece itself. In addition, they will not mark so much the piece, when they are removed. Most of the available software, either analysis software or either the own software of the printer machine, allow two options: making a design of the support structures, or automatically calculating and inserting these structures. A good guide for designing, using and calculate how and when using supports can be found in the following link: https://www.3dhubs.com/knowledge-base/supports-3d-printing-technology-overview. \n\n\n \n12  \nFigure 4: Different types of support structures. [13] 3.1.3. Model infill: When we talk about the infill it is about the structure printed inside the object. It means, if we think in the example of a cube, the six external walls will be printed in a solid way, with a certain thickness, but the internal part of the cube will not be solid; you will have to choose the infill percentage, and even the geometrical shape of the infill. The geometrical pattern of the infill can be also chosen. Some of them are more resistant than others, but generally, the default pattern of the software can be selected. Percentage and pattern shape will be chosen according to several aspects: total weight of the piece, used material, resistance to be achieved, printing time and sometimes decorative features. In general, the greater the infill percentage, the stronger the printed piece will be, but the longer will take to be printed. A percentage about 15% usually is enough. Hereunder some examples can be seen (on software and on printed pieces):  \n Figure 5: Different infill percentages and patterns. [14] 3.1.4. Positioning and orientation To decide the position and orientation of the piece on the printing surface or printing bed is one of the most important part of the whole process. It is a decision that will have a great impact on the piece quality and properties. \n\n\n \n13  \nOne of the most used criteria for choosing position and orientation is using the minimum amount of material (and spending less printing time). This is achieved by minimizing overhang parts. Consequently, less support structures will be printed and the piece will be built in less time. However, sometimes quality to achieve is more important, so that orientations that are not optimal in terms of material and printing time, can be chosen. Some tips, in a general way, are: • To center the pieces in the printing surface or bed surface. This will reduce the movements of the printing head (and, consequently, the printing time). Furthermore, it will increase the quality and precision of the piece, because printing platforms are usually more leveled and calibrated in its central part, and also because if they are heated, heat is greater in the central part. • If there are curved or sloped surfaces, and these parts of the piece are desired to be printed with quality, piece should be positioned so that these surfaces are positioned on XY plane (horizontal plane), or as parallel as possible to this plane. So \"stair-stepping\" effect will be avoided, in which curved or sloped surfaces are not smooth. • Watching the previous picture, if the piece has an inner hole, or a through hole, it would be adequate to put this hole with its axis perpendicular to the printing bed, if a great quality is required in the hole surface. • A very long and plane section printed on the horizontal plane or XY plane may suffer deformation, which means that its outer borders get cold and shrink very quick, causing the piece to warp upwards. Sometimes, to print these pieces so their longest section is perpendicular to the building plate is convenient. • In a general way, the top surface of a printed piece will have the best finishing. • If we are printing functional pieces, that have to withstand forces and loads, it is much more likely for them to de-laminate and to break when the forces or loads are perpendicular to the layers direction.  3.1.5. Generating the G-Code. Once all the previous steps have being developed, it is time to generate what is known as G-Code or machine code. This code is the translation of the piece (and all the parameters that have been previously set) into instructions that the machine can understand. Before that, depending on the used software, it is necessary to choose the layer height or layer thickness. This parameter has also a lot of importance and it will have a great impact on the final quality of the surface of the piece. A higher layer height will result on a great resolution or quality, but also will result on a greater printing time. It is quite important to understand what is more important: aesthetics or a quick and cheap printing. Sometimes, differences between two identical pieces, but with layers height of 100 microns and 200 microns are hard to distinguish. But the 100 microns piece will take the double to print and will cost more. Therefore, it is very important to know what is the final use of a piece. It is also crucial to know the amount of curves and angles of the piece, because the layers height is more visible on these parts than on straight walls.  \n\n \n14  \n Figure 6: Two different layer heights. [15] To sum up with the layer height matter, it is noticeable that for each machine and technology a certain range of layer height values is available to be chosen. For example, for FDM, a very common range is from 50 to 300 microns (0.05 to 0.3 millimetres). So, at this point the G-Code must be generated, and this can be done by various software. Probably, some of the programs to be used may have already be used in a previous step. The program cuts the model into horizontal \"slices\" or layers, generating the path that the machine head will follow. It also calculates the amount of material (weight and metres) and the estimated printing time. With the chosen program, the G-Code is exported and saved, in a SD card or in a pen drive. Or it can be also directly sent to the machine, depending on the software and machine. To sum up this part, it should be taken into account that there are a lot of parameters that can be changed: wall thickness, printing speeds, printing temperatures and bed temperature, flow, etc. But these are parameters to edit by users with experience, and it is advisable to let them default.  3.4. 3D printing: Now the G-Code has being obtained the process of 3D printing can be implemented. There are a few things to consider and to check before printing. For FDM printers, the temperatures of the bed or printing platform and of the extruder must to be checked (the software or the printer do that automatically when you start to print). To use some kind of lacquer or varnish is also recommendable in order to ease the extraction of the piece. It is advisable to read the instructions to also know how to load the filament on the printer for example, and for further information. Therefore, the G-Code is sent to the machine, and the machine starts to work.  3.5. Extracting pieces: When the printer has already finished, it is the moment to implement the process of extracting the piece/s. Once again, depending on the machine and mainly, on the technology and used materials, the extraction processes will vary. For fused deposition modelling machines (FDM), pieces often are removed by hand, or with some tool like a blade. It is also possible to have flexible platforms that ease a lot the extraction. There are even other methods such as using a solvent, or applying cold or with dental floss.  \n\n\n \n15  \n Figure 7: Extraction. [16]  3.6. Post-processing: For a lot of pieces, a finishing process is needed, that once again varies along the kind of technology and kind of machine. For some technologies and machines this process is necessary.  First of all, it is important to note that some of the printed pieces may not need a post-processing step. Or maybe some of them will need just to remove mechanically the support structures. There are a lot of finishing processes and post-processes: • Remove support structures: This can be done mechanically, as it has been said, or by the use of a solvent bath (even water), if the printing material is the adequate one.  Figure 8: Mechanical process and bath for removing the support structures. [17] [18] • Sanding: It is a process to apply when the support structures have been already removed. Several sanding grades can be chosen. • Polishing: If the piece is wanted to have a \"mirror-like\" surface it is necessary to polish the piece. It is needed to sanding the piece with a sandpaper of number 2000, previously. Then, the powder should be cleaned and the piece will be polished with a microfiber cloth and a special enamel, which will produce a lasting shine. There are also rotary sanders and polishers. • Coatings: All the pieces are capable of applying a coating. In the case of paints, it is advisable to apply first a coat layer and then to paint with aerosol, acrylics or airbrushes. Epoxy gels, metal coatings, etc. are also available. \n\n\n \n16  \n Figure 9: Different finishing. [19] There are more finishing processes: shot blasting, smoothing with acetone vapour... For knowing more post-processes for FDM technology the following link is provided: https://www.3dhubs.com/knowledge-base/post-processing-fdm-printed-parts    4. SOFTWARE THAT YOU NEED FOR 3D PRINTING There are different software for each form of creation of the 3D object, as well as for each phase of the process. To know which software you have the most affinity and meets your needs, you have to study and evaluate which one is most appropriate for your workflow and your technical level. The process for obtaining the 3D object is composed of 3 phases: Designing the 3D object, Repairing/Generating of the G-Code and Printing.  \n Figure 10: Process to develop a 3D Model. [20]  Some software are capable of doing the whole process, which means they have tools for 3D object creation, verification and repair, until the generation of G-Code. Below we explain the software available for creation of 3D object; they are divided into 3 groups.  4.1 Programmes for designing There are three ways to create the 3D object: Modelling, Scanning and Downloading repositories that are already available online.  \n\n\n \n17  \nModelling  Many programmes can be used to create or draw a 3D Model since the beginning. They have different levels of complexity, also different licenses. To choose which of them meets your work needs and fits to your abilities, we list them below, with a brief description and links, that you can you to know more about them.  \n Table 1: Software to Designing a 3D Model. [21] Scanning: By using 3D scanning you will be able to capture a digital copy of a physical real world object. Different technologies are able to scan an object to create a 3D Model, as example: time-of-flight, structured / modulated light, volumetric scanning etc. Some scanners are listed here: Downloading  The third possibility to have your 3D Model is downloading it from websites of repositories, read to print or that needs a small correction. 4.2 Programmes for testing, orientating and repairing Before you can print your 3D Model, you need to analyse the 3D model. This will show if any part cannot be printed or if there is a failure. Then it is possible to repair, to decrease or increase the triangles that form the surface that will be printed, and to cut the model in parts if necessary. \n\n\n \n18  \nThere are some software available to do this part of the process, below you find a list with the most used:  https://knowledge.autodesk.com/support/netfabb?p=NETF&skill=Beginner&sort=score&page=1&v=2017  http://www.meshlab.net/#support  https://www.mmmanual.com/ Table 2: Software to Testing, Orientating and Repair a 3D Model. [22]   4.3 Programmes for generating the G-code G-code is a language in which people tell computerized machine tools how to make something. The \"how\" is defined by instructions on where to move, how fast to move, and what path to follow. The G-Code can be generated with many different software like Skeinforge, Cura, Slic3r... One of the more used software is Slic3r. It is a necessary tool to convert a 3D model into printing instructions (G-code) for the 3D printer. It cuts the model into horizontal slices (layers), generates toolpaths to fill them and calculates the amount of material to be extruded. It is possible to scale, rotate, split or cut the object, and also to add support.  4.4 3D Printing Workflow \n Figure 11. Diagram 3D Printing Workflow. [23] \nPLATFORM \n\n \n19  \n5. 3D PRINTING MATERIALS  5.1 Overview When it comes to 3D printing, materials are often one of the most important choice. Earlier AM technologies were making use of certain materials which proved to be non-resistant enough and were degrading quickly. With time, the knowledge about 3D printing has been extending and has been spreading all over the world. With more people interested and the idea that this technology has the right potential to lead to new innovative ways of manufacturing, further studies and analysis has been conducted and new materials have been created. Some examples are visible on 3dhubs.com, a portal which provides 3D printing services on a global level [24]: • Prototyping Plastic, suitable for fast and cost-effective prototyping; • High Detail Resin, suitable for intricate designs and sculptures; • SLS Nylon, for functional prototypes and end-use parts; • Fibre-Reinforced Nylon, for engineering strong parts; • Rigid Opaque Plastic, for realistic prototypes with high accuracy; • Rubber-Like Plastic, simulating rubber; • Transparent Plastic, to create see-through parts and prototypes; • Simulated ABS, with high precision and functional moulds; • Full Colour Sandstone, for photo-realistic models; • Industrial Metals, for prototypes and end-use parts.   5.2 FDM 3D Printing Materials For what concerns Fused Deposition Modeling (FDM), some of the most popular materials are: • Thermoplastic Filament  • PLA: Easy to print, very accurate, low melting point, rigid. Good for most things, not for warm/hot regions.  • ABS: Tends to warp, strong and slightly flexible. Used for many mechanical parts.  • PETG: Easy to print & accurate, tends to string, good layer adhesion.  • TPU: Flexible polymer; ok to print, kind of like stiff rubber. Best used with direct-drive machines.  • Nylon: Strong and flexible; special filament for printers exist. Polycarbonate: Obnoxiously strong, high warp, high temp, bad fumes [Paul Chase, 3D Printing 101. 2016.] Concerning ABS and PLA, there is no limit that one can do of them, for example they can be mixed together. They represent a much better solution to using pure plastic material; this is, \n\n \n20  \nin fact, relatively expensive, with a low strength and durability. Final products can usually be distorted easily. Therefore, plastics do not make FDM cost-effective, nor it allows the technology to be applied in functional and load-bearing applications, especially in a large-scale production. ABS filaments, instead, can take a variety of forms and can be engineered to have many properties. Therefore, they are strong, but also very flexible; they can be sanded and machined, plus acetone can be used to gloss the parts through brushing or dipping them in it. A first comparison between ABS and PLA is that the former filaments are much easier to be recycled, another reason why most of engineers would rather prefer using this kind of material.    6. LIMITATIONS OF PRINTED OBJECTS. In this section we aim to show the limitations of both additive manufacturing and 3D printing in general, as well as the particular limitations of each technology, focusing on the technology Fused deposition Modelling (FDM).  6.1 Limitations of additive manufacturing and 3D printing. Despite the obvious advances that this technology can bring to the industry due to its indisputable advantages, there are limitations that make additive manufacturing technologies not widely implemented in many sectors. The current limitations are due both to the AM processes themselves, which can still be improved, as well as to auxiliary processes (previous manipulations of material, post-processing, quality control ...) that in many cases condition their viability. The lack of knowledge on how to design the products and how to reorient the companies to successfully integrate these new technologies also influences. [25] Some of these limitations are the following: Technologies in development: Many of the technologies are in continuous development. Some of them are still in early stages of development. In a few years, a machine may be outdated or outmoded. Availability and cost of the raw material: Getting the supply of materials at some points can be complicated. Also, some materials are quite expensive, if you are looking for very specific properties. The most basic and cheap material is usually plastic. Initial investment: Desktop FDM printers are usually cheap, but for other technologies, especially if larger machine sizes are sought, the initial investment can be very high. Size of the pieces: The size of the pieces to produce depends on the printing bed. While it is true that many large pieces can be chopped and then joined. \n\n \n21  \nNon-profitable mass production: Additive manufacturing and 3D printing are designed for very short series of pieces (around 1 - 10 units). For longer series, production with these technologies is not profitable. Finishes and precision: In general, getting very good finish and very good precision will be expensive. That is to say, it will be necessary to resort to more expensive technologies and machines. In addition, the parts may require post-processes, other machines and special sub-processes. Obtaining digital files: If specific and highly customized pieces are desired, it is necessary to possess advanced CAD design knowledge. Most of the time, the repositories of CAD files are not enough. The same goes for the 3D scanner; they are expensive and using it requires certain knowledge.   6.2 FDM limitations table. LIMITATIONS NAME DESCRIPTION SKETCH FDM Supported Walls Walls that are connected to the rest of the print on at least two sides.  0.8 mm Unsupported Walls Unsupported walls are connected to the rest of the print on less than two sides.  0.8 mm Support & Overhangs The maximum angle a wall can be printed at without requiring support.  45° Embossed & Engraved Details Features on the model that are raised or recessed below the model surface.  0.6 mm wide &2 00 high Horizontal Bridges The span a technology can print without the need for support.   10 mm Holes The minimum diameter a technology can successfully print a hole.   \u0000 2 mm Connecting/Moving Parts The recommended clearance between two moving or connecting parts.  0.5 mm Minimum Features The recommended minimum size of a feature to ensure it will not fail to print.   2 mm \n\n\n \n22  \nPin Diameter The minimum diameter a pin can be printed at.  3 mm Tolerance The expected tolerance (diameter accuracy) of a specific technology.  ± 0.5% (lower limit ± 0.5 mm) Table 3: Comparative table. [26]   6.3 Introduction to the limitations of FDM technology. Going a little deeper into the FDM technology here we show some of its limitations in detail and propose some methods that can be implemented in the design stage to minimize the impact of these limitations when printing an object.  BRIDGING Bridging in FDM occurs when the printer is required to print between two supports or anchor points. Because there is no support offered for the initial layer being printed (there is nothing to build upon) and it is required to “bridge” a gap, the material will tend to sag. Bridges occur most often in horizontal axis holes found in the walls of objects or in the top layer (or roof) of hollow parts. One solution to reduce the impact of bridging is to reduce the distance of the bridge, but this will depend upon the design constraints of the part. Another solution to avoid sagging is to include support. Support offers a temporary build platform for the bridging layer to be built upon. The support material is then removed once the print has been completed. This can leave marks or damage upon the surface where the support was connected to the final part.  VERTICAL AXIS HOLES FDM will often print vertical axis holes undersized. The general process for printing a hole diameter and the reason the reduction in diameter occurs is: 1. As the nozzle prints the perimeter of a vertical axis hole, it compresses the newly printed layer down onto the existing build layers to help improve adhesion. 2. The compressing force from the nozzle deforms the extruded round layer shape from a circle into a wider and flatter shape (see image below). 3. This increases the area of contact with the previously printed layer (improving adhesion), but also increases the width of the extruded segment. 4. The result of this is a decrease in the diameter of the hole that is being printed. This can be of particular issue when printing small diameter holes where the effect is greater due to the ratio of hole diameter to nozzle diameter. The amount of undersize will depend on the printer, the slicing software, the size of the hole, and the material. Often, the reduction in diameter of vertical axis holes is accounted for in the slicing program, but accuracy can vary and several test prints may be needed to achieve the desired accuracy. If a high level of accuracy is required, drilling the hole after printing may be required.  \n\n\n \n23  \nOVERHANGS Issues with overhang are one of the most common print quality problems relating to FDM. Overhangs occur when the printed layer of material is only partially supported by the layer below. Similar to bridging, the inadequate support provided by the surface below the build layer can result in poor layer adhesion, bulging or curling. An overhang can usually be printed with no loss of quality up to 45 degrees, depending on the material. At 45 degrees, the newly printed layer is supported by 50% of the previous layer. This allows sufficient support and adhesion to build upon. Above 45 degrees, support is required to ensure that the newly printed layer does not bulge down and away from the nozzle. Another issue that occurs when printing overhangs is curling. The newly printed layer becomes increasingly thinner at the edge of the overhang, resulting in differential cooling causing it to deform upward.  CORNERS Because the printing nozzle in FDM is circular, corners and edges will have a radius that is equal to the size of the nozzle. This means that these features will never be perfectly square. For sharp edges and corners, the first layers of a print are particularly important. As discussed above for vertical holes, as the nozzle prints each layer, it compresses the print material down to improve adhesion. For the initial print layer, this creates a flare often called an “elephant's foot”. This can impact the ability to assemble FDM parts as this flare protrudes outside the specified dimensions. Another issue that is often present relating to the first print layer of an FDM print is warping. ABS is more vulnerable to warping due to its high printing temperature when compared to PLA. The base layer is the first layer to be printed and cools as the other hot layers are printed on top. This causes differential cooling and can result in the base layer curling up and away from the build plate as it shrinks and contracts. The addition of a chamfer or radius along the edges of the part that are in contact with the build plate will reduce the impact of these problems. This will also assist in removal of the component from the build plate once the print has been completed.  VERTICAL PINS Vertical pins are often printed in FDM when assembly of parts or alignment is required. Considering that these features are often functional, it is important to understand the size of vertical pins that FDM can print accurately. Large pins (greater than 5mm diameter) are printed with a perimeter and infill, affording a strong connection to the rest of the print. Smaller diameter pins (less than 5mm diameter) can be made up of only perimeter prints with no infill. This creates discontinuity between the rest of the print and the pin, resulting in a weak connection that is susceptible to breaking. In a worst case scenario, small pins may not print at all as there is not enough print material for the newly printed layers to adhere to. Often correct printer calibration (optimal layer height, print speed, nozzle temperature etc.) can reduce the likelihood of small pins failing. The addition of a radius at the base of the pin will eliminate that point as a stress concentration and add strength. For critical pins smaller \n\n \n24  \nthan 5mm diameter, an off the shelf pin inserted into a printed hole may be the optimal solution.  ADVANCED DESIGN Several key aspects to consider when printing with FDM are how to reduce the amount of support required, part orientation and the direction the part is built on the build platform. Often, splitting up a model can reduce its complexity, saving on cost and time. Overhangs that require a large amount of support may be removed by simply splitting a complex shape into sections that are printed individually. If desired, the sections can be glued together once the print has been completed.   HOLE ORIENTATION Support for holes is best avoided by changing the print orientation. Removal of support in horizontal axis holes can often be difficult, but by rotating the build direction 90 degrees, the need for support is eliminated. For components with multiple holes in different directions, prioritize blind holes, then holes with the smallest to largest diameter, then criticality of hole size.  BUILD DIRECTION Due to the anisotropic nature of FDM printing, understanding the application of a component and how it is built are critical to the success of a design. FDM components are inherently weaker in one direction due to layer orientation. [27]    7. EXAMPLE In this chapter it is intended to show, by a real example, all the steps to follow for, starting from a model or digital file, getting a real printed piece. The example shown hereunder is about a heritage reproduction project. It arises from the need to make certain pieces of the Museum of Natural History of Valencia accessible to blind people. Specifically, the project is about the lower part of a tiger jaw. The project begins with the 3D scanning of the original jaw, getting a digital model then. This example will begin from this point.  \n\n \n25  \n Figure 12: Digital model, result of the 3D scanning. [28] Whatever it is the file format, it has to be exported to STL, as it has been shown in other chapters of this guide. As it can be seen almost simple sight in the previous Figure, the model has several errors that need to be repaired, like the teeth part, for example. For that, several software can be used. The process of analysis and repairing will be explained here with free-access software. For example: Meshmixer, from Autodesk. Before seeing the process of analysis and reparation of a STL model, it is noted that, this model under consideration was processed by a certain software (Meshlab, specifically) in order to reduce the file size. The model mesh had a very high and excessive number of triangles, so this number was lowed and hence, the file size. This is a step that just a few times is necessary to implement, so it is just mentioned. For further information about how to reduce the number of triangles of a mesh, and hence the size file, the following link is provided: https://www.shapeways.com/tutorials/polygon_reduction_with_meshlab So, as it was said before, the STL model will be opened with Meshmixer, by clicking on Import. The first thing that can be seen is that the model orientation could not be the adequate one. There is no need to be worry about that. Meshmixer allows you to change it by clicking on Edit > Transform. In addition, we will not print by Meshmixer, so orientation has been adjusted approximately, as can be seen here:  \n Figure 13: Positioning the model in Meshmixer. [29] \n\n\n \n26  \nThereupon, a general analysis of the defects of the piece is made. For that, Inspector option is used, in Analysis section. Meshmixer detects and shows all the errors in the model or file. The different mistakes are shown in different colours, and they are shown by balls and arrows. Holes in the mesh are displayed in blue, non-manifold points or edges are displayed in red, and disconnected components or elements with a very little area are displayed in magenta. There are two options now, either repairing the errors one by one by clicking on the \"ball\", or either clicking on Auto Repair All and repairing everything at once.  \n Figure 14: General analysis in Meshmixer. [30] In this case, the software repairs all the found defects automatically. If not, it is possible to use other software and implement other analysis and reparation process. With Meshmixer it is also possible to perform other kind of analysis such as: thickness, stability, orientation and positioning on the printing base, etc. So, at this point, the STL model is completely repaired and it is ready for the next step. As it can be seen, the program has closed every hole in the mesh, and it has repaired all the defects. It is noted that the software does these reparations automatically, trying to get close, more or less, to the geometry around the defect. If holes or gaps in the mesh are intended to be repaired with a certain geometry it is needed to use a digital sculpture software. It is true that Meshmixer has a digital sculpture option, but it will not be explained in this example, because it is not an objective of this guide.  \n\n\n \n27  \n Figure 15: Jaw with repaired holes and defects. [31] So now, in Meshmixer, the repaired and fixed model must be exported or saved again in STL format. The next step is to load the file in a software that allows to do, at least, the following things: - Choosing an orientation in the printing bed. Rotating and moving the model. - Scaling the model. - Choosing the quality or layer height. - Choosing the infill. Density among other issue. - Generating the needed support structures. In addition, with this software the G-Code or machine code will be also generated. There is different free software for doing this. For example, Ultimaker Cura or Slic3r. In this example Cura is used. So, in Cura the repaired model is imported. To configure the software in order to show the printing bed of the machine now is convenient. Cura has a very big data base of commercial 3D printers. If the used machine is not in that data base, it is also possible to create it from scratch. This model is going to be scaled to 60%. 0.2 mm. is the chosen layer quality. A grid infill of 15% density is also chosen. Automatically support structures will be generated everywhere, and in order to get a good adhesion for the first layer, \"first layer speed\" will be set to 20 mm/s. working material is also chosen: PLA. Finally, the G-Code is saved in the device to insert in the printer by clicking on \"Save to File\".  \n Figure 16: Model loaded and configuration and parameters of the model in Cura. [32] \n\n\n \n28  \nAt this point, it is possible to go to the next step of the process: 3D printing itself. It is needed to go to the machine and, by the appropriated means, to launch the print job. The machine will be left working, and it is recommended to see it from time to time in order to see if everything goes correctly. It is important to say that it is highly recommended to check if the first printed layer is correctly stick to the bed or platform. If not, the following guide is provided: https://www.simplify3d.com/support/print-quality-troubleshooting/#print-not-sticking-to-the-bed In the next picture the printing sequence is shown, for the given example:  \n Figure 17: Jaw printing sequence. [33] The next step is, obviously, to extract the printed piece. A spatula with rounded edges is used, in order not to scratch and not to damage the printing platform. Once the piece has been extracted of the platform, it is time for the post-processing step, consisting on manually and mechanically removing the support structures, and sanding those parts of the piece that have marks (from support structures, for example). The printing bed should be correctly cleaned for the next print job... As mentioned, to sand the marks of the support structures, among others, is very convenient. At the end, the final result of the piece is the following one:  \n\n\n \n29  \nFigure 18: Final result. [34]  If the result at any point of the printing process, or at the end of the printing process is not good, or some errors and shrinkages are seen, the following guide can be very helpful, in order to configure some printing parameters or parameters of the printer: https://www.simplify3d.com/support/print-quality-troubleshooting/\t\t\t\t\t\t\t\t\t\t\t\tSOURCES\t\t[1] What is Additive Manufacturing? Source: https://www.3dhubs.com/what-is-3d-printing \nThis\tguide\tis\ta\tsummary\tof\tthe\tdocument\tIO1/A1\tTransfer\tof\tknowledge\tabout\tbasics\tof\t3D\tprinting\tconcepts\tto\tthe\tVET\tTeachers.\t \n\n \n30  \n[2] Scheme 1: Processes and manufacturing techniques. Source: KIT [3] How does 3D printing work? Source: https://www.createeducation.com/about-us/introduction/ [4] Figure 1: 3D printing process. Source: KIT [5] Rapid prototyping technology for the development of new products. 2016. Source: http://ijiset.com/vol3/v3s1/IJISET_V3_I1_39.pdf  [6] Figure 2: FDM Technology. Source: https://i.materialise.com/blog/3d-printing-technologies-and-materials/ [7] F. Kunz, A. A. Jorg, L. Chaabane: Innovation Infrastructure& Services. Switzerland Innovation Park Biel.  2017. [8] FDM Prints. 2017. Source: https://www.sculpteo.com/en/glossary/fdm-fused-deposition-modeling-definition/ [9] Surface modification of fused deposition modeling ABS to enable rapid prototyping of biomedical microdevices. 2013. Source: http://www.sciencedirect.com/science/article/pii/S092401361300006X [10] Scaffold Design and in Vitro Study of Osteochondral Coculture in a Three-Dimensional Porous Polycaprolactone Scaffold Fabricated by Fused Deposition Modeling. 2004. Source: http://online.liebertpub.com/doi/abs/10.1089/10763270360697012 [11] Scheme 2: Production process in 3D printing. Source: CETEM [12] Figure 3: Support structures. Source: https://www.geeky-gadgets.com/wp-content/uploads/2015/01/Form-1-3D-Printer-Update1.jpg  [13] Figure 4: Different types of support structures. Source: http://www.reppersdelight.spacymen.com/public/RD_images/MeshMixer_support3.jpg https://i.ytimg.com/vi/GThbJZZvRFY/maxresdefault.jpg https://www.simufact.com/files/Medien/_2Produkte/2.3_Simufact_Additive/Support-settings_more_support.png [14] Figure 5: Different infill percentages. Source: http://my3dmatter.com/wp-content/uploads/2015/03/infillpercentimage.png https://3dplatform.com/wp-content/uploads/2015/08/3DP-Infill-Percentage-1024x745.jpg Different infill patterns. Source: https://i.ytimg.com/vi/BMWTK2ZgJCM/maxresdefault.jpg https://assets.pinshape.com/uploads/image/file/98145/container_display-tray-for-infill-pattern-and-infill-density-3d-printing-98145.jpg [15] Figure 6: Two different layer heights. Source: http://wiki.ikaslab.org/images/thumb/8/8c/Altura_de_capa.jpg/700px-Altura_de_capa.jpg \n\n[Примечание: документ содержит 31 страниц, обработано 30]",
    "url": "",
    "section": "Документация",
    "problem_type": null,
    "printer_models": [],
    "materials": [],
    "symptoms": [],
    "solutions": [],
    "abstract": "",
    "relevance_score": 0.9,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "D:20190222144507Z00'00'",
    "author": "",
    "images": []
  },
  {
    "id": "3084198141619375355",
    "title": "Как устранить stringing (сопли) при печати PLA",
    "content": "\n            Stringing (сопли) - это проблема, когда между деталями появляются тонкие ниточки пластика.\n            \n            Основные причины:\n            1. Слишком высокая температура экструдера\n            2. Недостаточный retraction\n            3. Слишком медленная скорость печати\n            \n            Решения:\n            1. Уменьшите температуру на 5-10°C\n            2. Увеличьте retraction до 6-8 мм\n            3. Увеличьте скорость retraction до 45-60 мм/с\n            4. Включите функцию \"Coasting\" в настройках слайсера\n            ",
    "url": "https://3dtoday.ru/test/stringing-pla",
    "section": "Техничка",
    "problem_type": "stringing",
    "printer_models": [
      "Ender-3",
      "Ender-3 V2",
      "Ender-3 Pro"
    ],
    "materials": [
      "PLA"
    ],
    "symptoms": [
      "ниточки между деталями",
      "сопли",
      "паутина"
    ],
    "solutions": [
      {
        "parameter": "retraction_length",
        "value": 6,
        "unit": "mm",
        "description": "Увеличьте retraction до 6 мм"
      },
      {
        "parameter": "retraction_speed",
        "value": 45,
        "unit": "mm/s",
        "description": "Скорость retraction 45 мм/с"
      },
      {
        "parameter": "temperature",
        "value": 200,
        "unit": "°C",
        "description": "Уменьшите температуру до 200°C"
      }
    ],
    "abstract": "",
    "relevance_score": 0.95,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "2024-01-15",
    "author": "",
    "images": []
  },
  {
    "id": "3528452507722390424",
    "title": "Команда Йозефа Пруши готовит линейку 3D-принтеров с тулченджерами от Bondtech",
    "content": "Со следующего года чешская компания Prusa Research планирует предлагать 3D-принтеры линейки CORE One с системами автоматической смены инструмента INDX, разработанными в сотрудничестве с компанией Bondtech. Новый тулченджер концептуально схож с системой, установленной на\nОсновой для нового гибрида послужат 3D-принтеры CORE One. Базовая модель\nвыпущена осенью прошлого года\n, а в начале этого месяца компания\nанонсировала увеличенный вариант CORE One L\nи модернизированную версию базовой системы под обозначением CORE One+. Эти 3D-принтеры задуманы как прямые конкуренты продукции Bambu Lab — построены по кинематической схеме CoreXY, используют алгоритмы активного гашения вибраций, калибруются автоматически и совместимы с системами автоматической смены филаментов MMU3, способными работать с пятью материалами одновременно.\nНовый тренд в сегменте настольных экструзионных 3D-принтеров — системы автоматической смены инструмента, то есть тулченджеры. Системы автоматической смены  филамента первоначально развивались именно компанией Prusa Research, хотя и популяризированы компанией Bambu Lab, но при всем своем потенциале имеют серьезные недостатки, выраженные повышенным расходом материалов и значительными временными затратами на смену филаментов, включая выгрузку, загрузку, а затем прочистку хотэнда во избежание смешивания оттенков или разных материалов. Тулченджеры, с другой стороны, тоже позволяют работать с несколькими материалами, но с более быстрыми переходами с филамента на филамент и без больших объемов отходов.\nВ августе этого года\n3D-принтер с тулченджером выкатила компания Snapmaker\n, а буквально на днях свое решение\nзапустила в продажу Bambu Lab\n. Prusa Research даже не догоняет, а перегоняет, объединив усилия с хорошо известным шведским производителем экструдеров Bondtech. Результат совместной работы — система автоматической смены инструмента Bondtech INDX.\nОпыт создания тулченджеров у Prusa Research уже имеется: 3D-принтеры Original Prusa XL c такой системой, расширяемой до пяти головок,\nкомпания впервые продемонстрировала еще в 2021 году\n. Главная разница в том, что оригинальная разработка предусматривает именно смену головок, тогда как в INDX осуществляется смена хотэндов, аналогично варианту от Bambu Lab.\nТакой подход выливается в значительную экономию средств, ведь нет необходимости в оснащении 3D-принтера несколькими головками, к каждой из которых полагается свой механизм подачи филамента, термоблок, термистор и прочая. Головка одна, меняются только хотэнды. В то же время у INDX есть серьезное преимущество над разработкой от Bambu Lab: этот тулченджер не требует выгрузки филамента перед сменой хотэнда, а значит экономит еще больше времени.\nГоловка оснащена индукционным термоблоком и механизмом подачи филамента с динамической регулировкой прижима (Dynamic eXtruder). Индукционный нагрев занимает считанные секунды и, что не менее важно, позволяет хотэндам быстро охлаждаться, предотвращая «сопли». Динамическая регулировка прижима дает оптимальные результаты при подаче материалов с разной твердостью — от жесткого полилактида до эластичных полиуретанов. Температура считывается бесконтактным методом. Сменяемые модули не содержат никакой электроники, нагревателей или датчиков — это просто максимально простые и дешевые хотэнды, в отличие от сменяемых модулей той же Bambu Lab.\nНовый тулченджер может принимать до восьми насадок, хотя можно ограничиться и меньшим количеством — это оставляется на усмотрение покупателей. Первые поставки INDX ожидаются в первом квартале следующего года в виде апгрейдов к 3D-принтерам семейства CORE One. Bondtech также планирует предлагать новый тулченджер в связке с 3D-принтерами Voron.\nА у вас есть интересные новости? Поделитесь с нами своими разработками, и мы расскажем о них всему миру! Ждем ваши идеи по адресу news@3Dtoday.ru.",
    "url": "https://3dtoday.ru/blogs/news3dtoday/komanda-iozefa-prusi-gotovit-lineiku-3d-printerov-s-tulcendzerami-ot-bondtech",
    "section": "3D-печать",
    "problem_type": null,
    "printer_models": [
      "Prusa CORE One",
      "Prusa CORE One L",
      "Prusa CORE One+",
      "Original Prusa XL",
      "Bambu Lab",
      "Snapmaker",
      "Voron"
    ],
    "materials": [
      "Полилактид (PLA)",
      "Полиуретаны"
    ],
    "symptoms": [
      "Повышенный расход материалов (отходы при прочистке)",
      "Значительные временные затраты на выгрузку, загрузку и прочистку филамента",
      "Риск смешивания оттенков или материалов",
      "Необходимость выгрузки филамента перед сменой инструмента в конкурирующих решениях (Bambu Lab)"
    ],
    "solutions": [
      {
        "description": "Внедрение системы автоматической смены инструмента Bondtech INDX",
        "parameters": {
          "Принцип работы": "Смена хотэндов, а не целых печатающих голов",
          "Нагрев": "Индукционный термоблок (быстрый нагрев и охлаждение)",
          "Экструдер": "Dynamic eXtruder с динамической регулировкой прижима",
          "Вместимость": "До 8 сменных насадок",
          "Особенность": "Не требует выгрузки филамента перед сменой",
          "Конструкция модулей": "Без электроники, нагревателей и датчиков (низкая стоимость)"
        }
      }
    ],
    "abstract": "",
    "relevance_score": 0.9,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "",
    "author": "",
    "images": []
  },
  {
    "id": "4082698192828191888",
    "title": "Stringing or Oozing",
    "content": "Stringing or Oozing\nStringing (otherwise known as oozing, whiskers, or “hairy” prints) occurs when small strings of plastic are left behind on a 3D printed model. This is typically due to plastic oozing out of the nozzle while the extruder is moving to a new location. Thankfully, there are several settings within Simplify3D that can help with this issue. The most common setting that is used to combat excessive stringing is something that is known as retraction. If retraction is enabled, when the extruder is done printing one section of your model, the filament will be pulled backwards into the nozzle to act as a countermeasure against oozing. When it is time to begin printing again, the filament will be pushed back into the nozzle so that plastic once again begins extruding from the tip. To ensure retraction is enabled, click “Edit Process Settings” and click on the Extruder tab. Ensure that the retraction option is enabled for each of your extruders. In the sections below, we will discuss the important retraction settings as well as several other settings that can be used to combat stringing, such as the extruder temperature settings.\nCommon Solutions\nRetraction distance\nThe most important retraction setting is the retraction distance. This determines how much plastic is pulled out of the nozzle. In general, the more plastic that is retracted from the nozzle, the less likely the nozzle is to ooze while moving. Most direct-drive extruders only require a retraction distance of 0.5-2.0mm, while some Bowden extruders may require a retraction distance as high as 15mm due to the longer distance between the extruder drive gear and the heated nozzle. If you encounter stringing with your prints, try increasing the retraction distance by 1mm and test again to see if the performance improves.\nRetraction speed\nThe next retraction setting that you should check is the retraction speed. This determines how fast the filament is retracted from the nozzle. If you retract too slowly, the plastic will slowly ooze down through the nozzle and may start leaking before the extruder is done moving to its new destination. If you retract too quickly, the filament may separate from the hot plastic inside the nozzle, or the quick movement of the drive gear may even grind away pieces of your filament. There is usually a sweet spot somewhere between 1200-6000 mm/min (20-100 mm/s) where retraction performs best. Thankfully, Simplify3D has already provided many pre-configured profiles that can give you a starting point for what retraction speed works best, but the ideal value can vary depending on the material that you are using, so you may want to experiment to see if different speeds decrease the amount of stringing that you see.\nTemperature is too high\nOnce you have checked your retraction settings, the next most common cause for excessive stringing is the extruder temperature. If the temperature is too high, the plastic inside the nozzle will become less viscous and will leak out of the nozzle much more easily. However, if the temperature is too low, the plastic will still be somewhat solid and will have difficulty extruding from the nozzle. If you feel you have the correct retraction settings, but you are still encountering these issues, try decreasing your extruder temperature by 5-10 degrees. This can have a significant impact on the final print quality. You can adjust these settings by clicking “Edit Process Settings” and selecting the Temperature tab. Select your extruder from the list on the left, and then double-click on the temperature setpoint you wish to edit.\nLong movements over open spaces\nAs we discussed above, stringing occurs when the extruder is moving between two different locations, and during that move, plastic starts to ooze out of the nozzle. The length of this movement can have a large impact on how much oozing takes place. Short moves may be quick enough that the plastic does not have time to ooze out of the nozzle. However, long movements are much more likely to create strings. Thankfully, Simplify3D includes an extremely useful feature that can help minimize the length of these movements. The software is smart enough that it can automatically adjust the travel path to make sure that nozzle has a very short distance to travel over an open space. In fact, in many cases, the software may be able to find a travel path that avoids crossing an open space all together! This means that there is no possibility to create a string, because the nozzle will always be on top of the solid plastic and will never travel outside the part. To use this feature, click on the Advanced tab and enable the “Avoid crossing outline for travel movement” option.\nMovement Speed\nFinally, you may also find that increasing the movement speed of your machine can also reduce the amount of time that the extruder can ooze when moving between parts. You can verify what movement speeds your machine is using by clicking on the Speeds tab of your process settings. The X/Y Axis Movement Speed represents the side-to-side travel speed, and is frequently directly related to the amount of time your extruder spends moving over open air. If your machine can handle moving at higher speeds, you may find that increasing this settings can also reduce stringing between parts.",
    "url": "https://www.simplify3d.com/resources/print-quality-troubleshooting/stringing-or-oozing/",
    "section": "unknown",
    "problem_type": null,
    "printer_models": [],
    "materials": [],
    "symptoms": [
      "маленькие нити пластика",
      "усы",
      "волосатость печати"
    ],
    "solutions": [
      {
        "description": "Настройка дистанции ретракта (втягивания нити)",
        "parameters": {
          "Direct-drive экструдеры": "0.5-2.0 мм",
          "Bowden экструдеры": "до 15 мм",
          "Шаг изменения при тесте": "+1 мм"
        }
      },
      {
        "description": "Настройка скорости ретракта",
        "parameters": {
          "Оптимальный диапазон": "20-100 мм/с (1200-6000 мм/мин)"
        }
      },
      {
        "description": "Снижение температуры экструдера для повышения вязкости пластика",
        "parameters": {
          "Шаг снижения": "5-10 градусов"
        }
      }
    ],
    "abstract": "",
    "relevance_score": 1.0,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "2019-04-17",
    "author": "",
    "images": []
  },
  {
    "id": "4991386494624610745",
    "title": "Ученые ДВФУ создают продвинутые медицинские симуляторы",
    "content": "Коллектив лаборатории симуляционных технологий Школы медицины и наук о жизни Дальневосточного федерального университета разрабатывает хирургические тренажеры для обучения студентов-медиков. В производстве применяются технологии 3D-печати, готовые тренажеры используются в связке с технологиями дополненной и виртуальной реальности.\n\nМногоразовые симуляторы в точности воспроизводят анатомию, ультразвуковую картину и даже тактильные ощущения работы с живыми тканями. Наибольшим спросом среди преподавателей и студентов пользуются комплексы для обучения УЗ-диагностике и биопсии молочной железы.\n\nНеточный угол ввода иглы или дрожание рук молодого специалиста могут нанести вред больному. Физические модели обеспечивают реалистичные ощущения и позволяют закреплять теоретические знания на практике, а современные AR/VR-технологии расширяют возможности обычных тренажеров. Обучающийся надевает очки дополненной реальности, и перед ним открывается не просто симулятор, а виртуальная среда с ультразвуковым кабинетом и пошаговой инструкцией по выполнению процедуры.\n\nОдной из последних разработок команды стал симулятор для отработки пункции межпозвонковых дисков под контролем C-дуги. Исследователи провели серию экспериментов и нашли состав, который под С-дугой выглядит в точности, как кость человека. Это один из немногих российских симуляторов, где рентген-картина не имитируется, а создается физически. В производстве учебных пособий используются в том числе технологии 3D-печати.",
    "url": "https://3dtoday.ru/blogs/news3dtoday/ucenye-dvfu-sozdayut-prodvinutye-medicinskie-simulyatory",
    "section": "Применение",
    "problem_type": null,
    "printer_models": [],
    "materials": [],
    "symptoms": [],
    "solutions": [
      {
        "description": "Разработка и 3D-печать анатомически точных многоразовых тренажеров, имитирующих тактильные ощущения и рентгенологическую картину живых тканей.",
        "parameters": {}
      },
      {
        "description": "Интеграция физических моделей с AR/VR средой для пошагового обучения.",
        "parameters": {}
      }
    ],
    "abstract": "",
    "relevance_score": 0.85,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "05.12.2025",
    "author": "",
    "images": []
  },
  {
    "id": "7004327633537333049",
    "title": "Microsoft Word - IO1_A1_Transfer of knowledge about basic of 3D printing concepts to the VET teachers - ShortVersion - NewTemplate.docx",
    "content": " \t\t\nIO1 – Methodology for defining 3D printing exercises suitable for transversal education    3D PRINTING TECHNICAL GUIDE - SUMMARY -    - O1A1- Transfer of knowledge about basics of 3D printing concepts to the VET teachers.  \n\n \n2  \nERASMUS3D+ For the immersion in 3D printing of VET centres.  Project Agreement Number  2017-1-DE02-KA202-004159  This work is licensed under  https://creativecommons.org/licenses/by-nc-nd/4.0/   PARTICIPANT ORGANIZATIONS      Disclaimer:  \"The European Commission support for the production of this publication does not constitute an endorsement of the contents which reflects the views only of the authors, and the Commission cannot be held responsible for any use which may be made of the information contained therein.\"   Output Identification O1 Output Title IO1 – Methodology for defining 3D printing exercises suitable for transversal education Output Description O1 – A1.  Transfer of knowledge about basic of 3D printing concepts to the VET teachers. Version v.1.1 (Short Version) \t\t\t\n\n\n \n3  \nINDEX SCHEMES INDEX............................................................................................................................... 4 TABLES INDEX .................................................................................................................................. 4 1. INTRODUCTION TO ADDITIVE MANUFACTURING. .................................................................... 5 1.1 What is Additive Manufacturing?...................................................................................... 5 1.2 How does 3D printing work? ............................................................................................. 5 1.3 What is Rapid Prototyping? .............................................................................................. 6 2. FUSED DEPOSITION MODELING (FDM). .................................................................................... 7 3. PRODUCTION PROCESS IN 3D PRINTING ................................................................................... 8 3.1. Obtaining the digital model: ............................................................................................. 9 3.2. Exporting and repairing the STL file:................................................................................ 10 3.3. Testing, orientation, distribution and G-Code: ................................................................ 10 3.1.1. Analyzing the piece or model: ................................................................................. 10 3.1.2. Support structures: ................................................................................................. 11 3.1.3. Model infill: ............................................................................................................ 12 3.1.4. Positioning and orientation ..................................................................................... 12 3.1.5. Generating the G-Code. .......................................................................................... 13 3.4. 3D printing: .................................................................................................................... 14 3.5. Extracting pieces: ........................................................................................................... 14 3.6. Post-processing: ............................................................................................................. 15 4. SOFTWARE THAT YOU NEED FOR 3D PRINTING ...................................................................... 16 4.1 Programmes for designing .............................................................................................. 16 4.2 Programmes for testing, orientating and repairing.......................................................... 17 4.3 Programmes for generating the G-code .......................................................................... 18 4.4 3D Printing Workflow ..................................................................................................... 18 5. 3D PRINTING MATERIALS ....................................................................................................... 19 5.1 Overview ........................................................................................................................ 19 5.2 FDM 3D Printing Materials .............................................................................................. 19 6. LIMITATIONS OF PRINTED OBJECTS. ....................................................................................... 20 6.1 Limitations of additive manufacturing and 3D printing. ................................................... 20 6.2 FDM limitations table. .................................................................................................... 21 6.3 Introduction to the limitations of FDM technology. ........................................................ 22 7. EXAMPLE................................................................................................................................ 24  \n\n \n4  \nFIGURE INDEX Figure 1: 3D printing process. ........................................................................................................... 6 Figure 2: FDM Technology................................................................................................................ 7 Figure 3: Support structures. .......................................................................................................... 11 Figure 4: Different types of support structures. .............................................................................. 12 Figure 5: Different infill percentages and patterns.......................................................................... 12 Figure 6: Two different layer heights. ............................................................................................. 14 Figure 7: Extraction. ....................................................................................................................... 15 Figure 8: Mechanical process and bath for removing the support structures. ................................. 15 Figure 9: Different finishing. ........................................................................................................... 16 Figure 10: Process to develop a 3D Model. ..................................................................................... 16 Figure 11. Diagram 3D Printing Workflow. ..................................................................................... 18 Figure 13: Digital model, result of the 3D scanning. ........................................................................ 25 Figure 14: Positioning the model in Meshmixer. ............................................................................. 25 Figure 15: General analysis in Meshmixer. ..................................................................................... 26 Figure 16: Jaw with repaired holes and defects. ............................................................................. 27 Figure 17: Model loaded and configuration and parameters of the model in Cura. ......................... 27 Figure 18: Jaw printing sequence.] ................................................................................................. 28 Figure 19: Final result. .................................................................................................................... 29  SCHEMES INDEX Scheme 1: Processes and manufacturing techniques........................................................................ 5 Scheme 2: Production process in 3D printing ................................................................................... 9   TABLES INDEX Table 1: Software to Designing a 3D Model .................................................................................... 17 Table 2: Software to Testing, Orientating and Repair a 3D Model ................................................... 18 Table 3: Comparative table. ........................................................................................................... 22                  \n\n \n5  \n1. INTRODUCTION TO ADDITIVE MANUFACTURING.  1.1 What is Additive Manufacturing? Additive manufacturing or 3D printing (commonly called) is a process that creates a physical object from a digital design. There are different 3D printing technologies and materials you can print with, but all are based on the same principle: a digital model is turned into a solid three-dimensional physical object by adding material layer by layer. [1] It is important to point out from the beginning that Additive Manufacturing does not constitute a single technology but a set of manufacturing processes, very different from each other, that share three common characteristics: 1. They are manufacturing processes by addition of material to construct a solid three-dimensional object.  2. The object is constructed by superimposing successive layers of material. 3. The object is made from a digital 3D model.  They are called ADITIVE Manufacturing processes to differentiate them from conventional processes. Together with these, they are part of the set of processes available to the Industry.  Some of the most used additive manufacturing technologies that best suits to the educational area will be described in the following point of this guide. These technologies are: Fused Deposition Modeling (FDM), Stereolithography (SLA) and Selective Laser Sintering (SLS).    1.2 How does 3D printing work? It all starts with making or obtaining a virtual design of the object you want to create. This virtual design can be made in a CAD (Computer Aided Design) file using a 3D modeling program (for the creation of a totally new object) or with the use of a 3D scanner (to copy an existing object). A 3D scanner makes a 3D digital copy of an object.  There are also lots of online file repositories where you can download existing 3D files that will help get you started. \nPROCESSES AND MANUFACTURING TECHNIQUES\nSubtractive Manufacturing. \nForming Process (SPF)\nAdditive Manufacturing\nJoining process\nScheme 1: Processes and manufacturing techniques. [2] \n\n \n6  \nThe 3D printing process turns an object into many, tiny little slices, then builds it from the bottom up, slice by slice. The layers then build up to form a solid object. [3] \nSome advantages of Additive Manufacturing compared to conventional processes: • Fewer steps between the CAD model and the production of the part. • Generally, few human resource requirements due to a high level of automation. • A large number of geometrical forms can be manufactured, enabling for instance the production of parts which are topologically optimized, with internal channels, etc. • High-speed manufacturing for small, complex parts. • Generally, less material wastage. • Possibility to reconstruct damaged sections of existing objects, depending on the part material • No special tooling required.  1.3 What is Rapid Prototyping? Rapid prototyping is an automated process that quickly builds physical prototypes from 3D CAD files composed of surface quality or solid models. Any manufacturing process can be classified as either subtractive, formative or additive. Every manufacturing process either falls completely into one of these categories, or is a hybrid process falling into more than one. In the manufacturing arena, productivity is achieved by guiding a product from concept to market quickly and inexpensively. Rapid prototyping technology aids this process. [5] It is important not to confuse rapid prototyping with 3D printing or with additive manufacturing, because the concepts are used interchangeably and wrongly many times. We can say that additive manufacturing is one of the technologies with which we can produce a rapid prototyping product.  It is convenient to underline that every technology and every process has a starting point in common: computer aided design (CAD).   DesignSTL fileOBJ file...\nG-Code\n3D Print\n3D Object\nFigure 1: 3D printing process. [4] \n\n \n7  \n2. FUSED DEPOSITION MODELING (FDM). Home printers typically work with plastic filament. The technology behind this is often referred to Fused Deposition Modeling (FDM) is a 3D printing technology that works by extruding a thermoplastic polymer through a heated nozzle which gets deposited on a building stage. FDM is also considered to be a form of additive manufacturing, which at the same time is a “process of joining materials to make objects from 3D model data, usually layer upon layer”.  The mere process involves a plastic filament which is fed by a spool to the nozzle where the material is liquefied and “drawn” on the platform. As soon as it touches the build stage, the filament hardens while being gradually deposited, following a certain structure, in order to create the final 3D print. When a layer is drawn, the platform lowers by one-layer thickness so that the printer is able to start working on the next layer.  \n  There are many different materials which can be used with FDM. The most commonly used are ABS (Acrylonitrile Butadiene Styrene), PLA (Polylactic Acid) and Nylon (Polyamide), but other exotic varieties of materials can also be used, like a material blend of plastic and wood or carbon. [7] Because this technology presents some very good pros, FDM is often used in the area of non-functional prototypes in order to produce concept parts, functional models, prototypes in general, manufacturing tooling and modeling, and end use parts. More specifically, FDM can be used for low-volume production and prototypes aimed at form, fit and function tests.  At the same time, it is most commonly used in the aerospace sector, for example, to produce wind turbines. Anatomical models for medical use are also very much suitable to be built with this technology. Finally, FDM has slowly been enabling the rapid prototyping of biomedical micro devices, the kind of devices that are used on a daily basis in hospitals, for example, therefore very much fundamental, as it is considered both cheap, but at the same very safe. [8] When it comes to 3D printing technology, one of the very first concerns relate to its cost. While in general it is the long-term use of materials that can become a serious expense, \nFigure 2: FDM Technology [6] \n\n \n8  \nthose who want to engage with Fused Deposition Modeling have an advantage from the start; in fact, FDM printing machines are among the cheapest and most affordable especially for those who want to use it in a domestic environment. [9] As for accuracy, the 3D prints do not reach the same level of accuracy and quality of other items which are instead produced through the use of Stereolithography. That said, the result is considered to be fairly qualitative, depending on the sector where the technology is applied. Resolution depends mainly on the size of the nozzle that is used. The precision of the machine is dependent on the extruder movements on the X and Y axis, but there are other factors to be taken into consideration. For example, the bonding force between the layers is lower than in the Stereolithography process. Consequently, the weight of the layers might squeeze the lower layers, which can therefore influence and even compromise the quality of the 3D print. [10]    3. PRODUCTION PROCESS IN 3D PRINTING Hereunder, in this chapter, all the necessary processes and steps for, starting with a digital design, obtaining a real printed piece, are going to be described. It is important to mention that there is not just a single valid process for printing three dimensional pieces. What is explained in this guide are a certain number of steps that should be adapted to the type of piece, selected technology, type of machine, and even to the used software. Furthermore, the process that is described hereunder is mostly intended for fused deposition modelling (FDM) 3D printers. In the production process for 3D printing, experience, piece features, used machine, etc. have a lot of weight. It is for sure that someone with little or without experience will 3D print a lot of piece with failures, before he finds the key. The production process, in a generally speaking, is the following: \n\n \n9  \n 3.1. Obtaining the digital model: There are several possibilities for obtaining the 3D model or digital model that is wanted to print. In particular, there are three possibilities: • To model the piece using a CAD software: With this first option, in order to get the three-dimensional model, a computer aided design (CAD) software must be used. There are a lot of available CAD software for modelling, and there is not a best option; it will depend on the user and their abilities with the software.  • To obtain the geometry by Reverse Engineering and 3D scanners: By this option a 3D scanner is used to digitally obtain the geometry of a real object. This is not a simple process and some ability and experience is required. In addition, there are several types of 3D scanners, and they are usually expensive. The reverse engineering process usually is for copying, improving, or customizing real objects, or also for incorporating complex surfaces to a 3D modelled piece.  • Downloading the model from repositories or asking someone to design it for you: If you do not have knowledge in computer-aided 3D design, or you do not have the necessary equipment (or software, or even knowledge) for applying a process of reverse engineering, to download the model from a repository or to ask somebody to design it for you is the best option. Depending on whether the repository is a 3D printing model repository (e.g.: Thingiverse) or a more general digital model repository (e.g.: GrabCAD), the downloaded model will be ready for 3D printing or it will be not. \nScheme 2: Production process in 3D printing [11] \n\n \n10  \nIn the next tutorial it can be seen a range of CAD design tips for 3D printing, depending on the material selected: https://www.sculpteo.com/en/materials/materials-design-guidelines/ And in the next link it can be found more information and more tutorials about how modelling and preparing a piece for being 3D printed by different CAD software: https://www.sculpteo.com/en/tutorial/  3.2. Exporting and repairing the STL file: When you work designing and printing 3D models, a wide range of formats or types of files are available. Some of them are thought for designing or scanning, but others are associated to 3D printing, such as: STL, OBJ, PLY or FBX, among others. Depending on the modelled piece, on the software, on the 3D printer features, etc., one or another format must be used. In this guide, in order to unify criteria, it is explained how to export and use the STL file. When the piece is designed and modelled, a format conversion to the \".stl\" file is needed. If the piece has been downloaded from a repository, this conversion is frequently already done. However, if free or commercial CAD software has been used this conversion is needed. Normally, exporting a CAD design to STL format is as simple as going to the used software menu and clicking on \"Save as...\" or in \"Export\" and choosing STL. Sometimes, there are problems during conversion to STL, either because the model is not thought for 3D printing, either because the design in the CAD software has not being made correctly, or either other causes. So, the exported model may have some errors. These errors are of various kinds: holes or gaps, reversed triangles, duplicated faces or triangles, faces or triangles that intersect, singular points or faces (out of the model), etc. The digital model reparation is explained in the next step of the production process in 3D printing, because it is very linked to the implementation of analysis to the pieces.  3.3. Testing, orientation, distribution and G-Code: This stage of the production process in 3D printing is about the preparation of the pieces or digital models (previously exported to STL) for being 3D printed. It is about performing the next process, orderly:  3.1.1. Analyzing the piece or model: The analysis usually is necessary when pieces are relatively complex, or when the origin of the pieces is not known, or it can be done just if you want to be one hundred per cent that the piece is suitable for being 3D printing. In addition, a good analysis can detect errors in the triangle mesh arisen from the STL conversion. These analysis can be implemented by some software, that also is useful for other purposes or not. Implemented analysis of: - Thickness: Recommended thickness depends on the 3D printing machine (and frequently on the used technology). Some machines allow to bigger thickness than others. To search the specific machine and to see the allowed thickness should be enough. Generally speaking, for fused deposition modelling (FDM) machines, \n\n \n11  \nthickness about 1 millimetre should be considered, approximately. This parameter must not be confused with layer thickness. - Holes or gaps: The model want to be printed must be perfectly closed, or best said: it must be watertight. This means that the triangular mesh must not have holes or gaps, or what is the same, it must not have vertex or triangle points not joined; every of them must be connected to other triangles. - Angles and overhang:  By this analysis it can be found, depending on the selected technology and machine, if the model or piece will need of support structures for being printed. Generally, for FDM printers the minimum allowed inclination angle is 45 degrees. Finally, it is noticeable that many of the used programs for analysing the piece allow, not just to detect errors or problems, but also allow to repair, or what is best, auto repair the model.  3.1.2. Support structures: For some technologies, it is necessary that, in order to beat gravity and to print overhang parts (or with internal gaps), support structures are inserted on this zones. They are usually necessary from 45 degrees (for FDM printers).   Figure 3: Support structures. [12] Support structures are usually done by the same material as the piece, although there are 3D printers that print two materials: piece's one and support structures one. With these printers soluble support materials in certain liquids can be used. As support structures are thought just for holding the first layers of the model that are cantilevered or \"floating\", support structures are built lightly and using less material than for the piece itself. In addition, they will not mark so much the piece, when they are removed. Most of the available software, either analysis software or either the own software of the printer machine, allow two options: making a design of the support structures, or automatically calculating and inserting these structures. A good guide for designing, using and calculate how and when using supports can be found in the following link: https://www.3dhubs.com/knowledge-base/supports-3d-printing-technology-overview. \n\n\n \n12  \nFigure 4: Different types of support structures. [13] 3.1.3. Model infill: When we talk about the infill it is about the structure printed inside the object. It means, if we think in the example of a cube, the six external walls will be printed in a solid way, with a certain thickness, but the internal part of the cube will not be solid; you will have to choose the infill percentage, and even the geometrical shape of the infill. The geometrical pattern of the infill can be also chosen. Some of them are more resistant than others, but generally, the default pattern of the software can be selected. Percentage and pattern shape will be chosen according to several aspects: total weight of the piece, used material, resistance to be achieved, printing time and sometimes decorative features. In general, the greater the infill percentage, the stronger the printed piece will be, but the longer will take to be printed. A percentage about 15% usually is enough. Hereunder some examples can be seen (on software and on printed pieces):  \n Figure 5: Different infill percentages and patterns. [14] 3.1.4. Positioning and orientation To decide the position and orientation of the piece on the printing surface or printing bed is one of the most important part of the whole process. It is a decision that will have a great impact on the piece quality and properties. \n\n\n \n13  \nOne of the most used criteria for choosing position and orientation is using the minimum amount of material (and spending less printing time). This is achieved by minimizing overhang parts. Consequently, less support structures will be printed and the piece will be built in less time. However, sometimes quality to achieve is more important, so that orientations that are not optimal in terms of material and printing time, can be chosen. Some tips, in a general way, are: • To center the pieces in the printing surface or bed surface. This will reduce the movements of the printing head (and, consequently, the printing time). Furthermore, it will increase the quality and precision of the piece, because printing platforms are usually more leveled and calibrated in its central part, and also because if they are heated, heat is greater in the central part. • If there are curved or sloped surfaces, and these parts of the piece are desired to be printed with quality, piece should be positioned so that these surfaces are positioned on XY plane (horizontal plane), or as parallel as possible to this plane. So \"stair-stepping\" effect will be avoided, in which curved or sloped surfaces are not smooth. • Watching the previous picture, if the piece has an inner hole, or a through hole, it would be adequate to put this hole with its axis perpendicular to the printing bed, if a great quality is required in the hole surface. • A very long and plane section printed on the horizontal plane or XY plane may suffer deformation, which means that its outer borders get cold and shrink very quick, causing the piece to warp upwards. Sometimes, to print these pieces so their longest section is perpendicular to the building plate is convenient. • In a general way, the top surface of a printed piece will have the best finishing. • If we are printing functional pieces, that have to withstand forces and loads, it is much more likely for them to de-laminate and to break when the forces or loads are perpendicular to the layers direction.  3.1.5. Generating the G-Code. Once all the previous steps have being developed, it is time to generate what is known as G-Code or machine code. This code is the translation of the piece (and all the parameters that have been previously set) into instructions that the machine can understand. Before that, depending on the used software, it is necessary to choose the layer height or layer thickness. This parameter has also a lot of importance and it will have a great impact on the final quality of the surface of the piece. A higher layer height will result on a great resolution or quality, but also will result on a greater printing time. It is quite important to understand what is more important: aesthetics or a quick and cheap printing. Sometimes, differences between two identical pieces, but with layers height of 100 microns and 200 microns are hard to distinguish. But the 100 microns piece will take the double to print and will cost more. Therefore, it is very important to know what is the final use of a piece. It is also crucial to know the amount of curves and angles of the piece, because the layers height is more visible on these parts than on straight walls.  \n\n \n14  \n Figure 6: Two different layer heights. [15] To sum up with the layer height matter, it is noticeable that for each machine and technology a certain range of layer height values is available to be chosen. For example, for FDM, a very common range is from 50 to 300 microns (0.05 to 0.3 millimetres). So, at this point the G-Code must be generated, and this can be done by various software. Probably, some of the programs to be used may have already be used in a previous step. The program cuts the model into horizontal \"slices\" or layers, generating the path that the machine head will follow. It also calculates the amount of material (weight and metres) and the estimated printing time. With the chosen program, the G-Code is exported and saved, in a SD card or in a pen drive. Or it can be also directly sent to the machine, depending on the software and machine. To sum up this part, it should be taken into account that there are a lot of parameters that can be changed: wall thickness, printing speeds, printing temperatures and bed temperature, flow, etc. But these are parameters to edit by users with experience, and it is advisable to let them default.  3.4. 3D printing: Now the G-Code has being obtained the process of 3D printing can be implemented. There are a few things to consider and to check before printing. For FDM printers, the temperatures of the bed or printing platform and of the extruder must to be checked (the software or the printer do that automatically when you start to print). To use some kind of lacquer or varnish is also recommendable in order to ease the extraction of the piece. It is advisable to read the instructions to also know how to load the filament on the printer for example, and for further information. Therefore, the G-Code is sent to the machine, and the machine starts to work.  3.5. Extracting pieces: When the printer has already finished, it is the moment to implement the process of extracting the piece/s. Once again, depending on the machine and mainly, on the technology and used materials, the extraction processes will vary. For fused deposition modelling machines (FDM), pieces often are removed by hand, or with some tool like a blade. It is also possible to have flexible platforms that ease a lot the extraction. There are even other methods such as using a solvent, or applying cold or with dental floss.  \n\n\n \n15  \n Figure 7: Extraction. [16]  3.6. Post-processing: For a lot of pieces, a finishing process is needed, that once again varies along the kind of technology and kind of machine. For some technologies and machines this process is necessary.  First of all, it is important to note that some of the printed pieces may not need a post-processing step. Or maybe some of them will need just to remove mechanically the support structures. There are a lot of finishing processes and post-processes: • Remove support structures: This can be done mechanically, as it has been said, or by the use of a solvent bath (even water), if the printing material is the adequate one.  Figure 8: Mechanical process and bath for removing the support structures. [17] [18] • Sanding: It is a process to apply when the support structures have been already removed. Several sanding grades can be chosen. • Polishing: If the piece is wanted to have a \"mirror-like\" surface it is necessary to polish the piece. It is needed to sanding the piece with a sandpaper of number 2000, previously. Then, the powder should be cleaned and the piece will be polished with a microfiber cloth and a special enamel, which will produce a lasting shine. There are also rotary sanders and polishers. • Coatings: All the pieces are capable of applying a coating. In the case of paints, it is advisable to apply first a coat layer and then to paint with aerosol, acrylics or airbrushes. Epoxy gels, metal coatings, etc. are also available. \n\n\n \n16  \n Figure 9: Different finishing. [19] There are more finishing processes: shot blasting, smoothing with acetone vapour... For knowing more post-processes for FDM technology the following link is provided: https://www.3dhubs.com/knowledge-base/post-processing-fdm-printed-parts    4. SOFTWARE THAT YOU NEED FOR 3D PRINTING There are different software for each form of creation of the 3D object, as well as for each phase of the process. To know which software you have the most affinity and meets your needs, you have to study and evaluate which one is most appropriate for your workflow and your technical level. The process for obtaining the 3D object is composed of 3 phases: Designing the 3D object, Repairing/Generating of the G-Code and Printing.  \n Figure 10: Process to develop a 3D Model. [20]  Some software are capable of doing the whole process, which means they have tools for 3D object creation, verification and repair, until the generation of G-Code. Below we explain the software available for creation of 3D object; they are divided into 3 groups.  4.1 Programmes for designing There are three ways to create the 3D object: Modelling, Scanning and Downloading repositories that are already available online.  \n\n\n \n17  \nModelling  Many programmes can be used to create or draw a 3D Model since the beginning. They have different levels of complexity, also different licenses. To choose which of them meets your work needs and fits to your abilities, we list them below, with a brief description and links, that you can you to know more about them.  \n Table 1: Software to Designing a 3D Model. [21] Scanning: By using 3D scanning you will be able to capture a digital copy of a physical real world object. Different technologies are able to scan an object to create a 3D Model, as example: time-of-flight, structured / modulated light, volumetric scanning etc. Some scanners are listed here: Downloading  The third possibility to have your 3D Model is downloading it from websites of repositories, read to print or that needs a small correction. 4.2 Programmes for testing, orientating and repairing Before you can print your 3D Model, you need to analyse the 3D model. This will show if any part cannot be printed or if there is a failure. Then it is possible to repair, to decrease or increase the triangles that form the surface that will be printed, and to cut the model in parts if necessary. \n\n\n \n18  \nThere are some software available to do this part of the process, below you find a list with the most used:  https://knowledge.autodesk.com/support/netfabb?p=NETF&skill=Beginner&sort=score&page=1&v=2017  http://www.meshlab.net/#support  https://www.mmmanual.com/ Table 2: Software to Testing, Orientating and Repair a 3D Model. [22]   4.3 Programmes for generating the G-code G-code is a language in which people tell computerized machine tools how to make something. The \"how\" is defined by instructions on where to move, how fast to move, and what path to follow. The G-Code can be generated with many different software like Skeinforge, Cura, Slic3r... One of the more used software is Slic3r. It is a necessary tool to convert a 3D model into printing instructions (G-code) for the 3D printer. It cuts the model into horizontal slices (layers), generates toolpaths to fill them and calculates the amount of material to be extruded. It is possible to scale, rotate, split or cut the object, and also to add support.  4.4 3D Printing Workflow \n Figure 11. Diagram 3D Printing Workflow. [23] \nPLATFORM \n\n \n19  \n5. 3D PRINTING MATERIALS  5.1 Overview When it comes to 3D printing, materials are often one of the most important choice. Earlier AM technologies were making use of certain materials which proved to be non-resistant enough and were degrading quickly. With time, the knowledge about 3D printing has been extending and has been spreading all over the world. With more people interested and the idea that this technology has the right potential to lead to new innovative ways of manufacturing, further studies and analysis has been conducted and new materials have been created. Some examples are visible on 3dhubs.com, a portal which provides 3D printing services on a global level [24]: • Prototyping Plastic, suitable for fast and cost-effective prototyping; • High Detail Resin, suitable for intricate designs and sculptures; • SLS Nylon, for functional prototypes and end-use parts; • Fibre-Reinforced Nylon, for engineering strong parts; • Rigid Opaque Plastic, for realistic prototypes with high accuracy; • Rubber-Like Plastic, simulating rubber; • Transparent Plastic, to create see-through parts and prototypes; • Simulated ABS, with high precision and functional moulds; • Full Colour Sandstone, for photo-realistic models; • Industrial Metals, for prototypes and end-use parts.   5.2 FDM 3D Printing Materials For what concerns Fused Deposition Modeling (FDM), some of the most popular materials are: • Thermoplastic Filament  • PLA: Easy to print, very accurate, low melting point, rigid. Good for most things, not for warm/hot regions.  • ABS: Tends to warp, strong and slightly flexible. Used for many mechanical parts.  • PETG: Easy to print & accurate, tends to string, good layer adhesion.  • TPU: Flexible polymer; ok to print, kind of like stiff rubber. Best used with direct-drive machines.  • Nylon: Strong and flexible; special filament for printers exist. Polycarbonate: Obnoxiously strong, high warp, high temp, bad fumes [Paul Chase, 3D Printing 101. 2016.] Concerning ABS and PLA, there is no limit that one can do of them, for example they can be mixed together. They represent a much better solution to using pure plastic material; this is, \n\n \n20  \nin fact, relatively expensive, with a low strength and durability. Final products can usually be distorted easily. Therefore, plastics do not make FDM cost-effective, nor it allows the technology to be applied in functional and load-bearing applications, especially in a large-scale production. ABS filaments, instead, can take a variety of forms and can be engineered to have many properties. Therefore, they are strong, but also very flexible; they can be sanded and machined, plus acetone can be used to gloss the parts through brushing or dipping them in it. A first comparison between ABS and PLA is that the former filaments are much easier to be recycled, another reason why most of engineers would rather prefer using this kind of material.    6. LIMITATIONS OF PRINTED OBJECTS. In this section we aim to show the limitations of both additive manufacturing and 3D printing in general, as well as the particular limitations of each technology, focusing on the technology Fused deposition Modelling (FDM).  6.1 Limitations of additive manufacturing and 3D printing. Despite the obvious advances that this technology can bring to the industry due to its indisputable advantages, there are limitations that make additive manufacturing technologies not widely implemented in many sectors. The current limitations are due both to the AM processes themselves, which can still be improved, as well as to auxiliary processes (previous manipulations of material, post-processing, quality control ...) that in many cases condition their viability. The lack of knowledge on how to design the products and how to reorient the companies to successfully integrate these new technologies also influences. [25] Some of these limitations are the following: Technologies in development: Many of the technologies are in continuous development. Some of them are still in early stages of development. In a few years, a machine may be outdated or outmoded. Availability and cost of the raw material: Getting the supply of materials at some points can be complicated. Also, some materials are quite expensive, if you are looking for very specific properties. The most basic and cheap material is usually plastic. Initial investment: Desktop FDM printers are usually cheap, but for other technologies, especially if larger machine sizes are sought, the initial investment can be very high. Size of the pieces: The size of the pieces to produce depends on the printing bed. While it is true that many large pieces can be chopped and then joined. \n\n \n21  \nNon-profitable mass production: Additive manufacturing and 3D printing are designed for very short series of pieces (around 1 - 10 units). For longer series, production with these technologies is not profitable. Finishes and precision: In general, getting very good finish and very good precision will be expensive. That is to say, it will be necessary to resort to more expensive technologies and machines. In addition, the parts may require post-processes, other machines and special sub-processes. Obtaining digital files: If specific and highly customized pieces are desired, it is necessary to possess advanced CAD design knowledge. Most of the time, the repositories of CAD files are not enough. The same goes for the 3D scanner; they are expensive and using it requires certain knowledge.   6.2 FDM limitations table. LIMITATIONS NAME DESCRIPTION SKETCH FDM Supported Walls Walls that are connected to the rest of the print on at least two sides.  0.8 mm Unsupported Walls Unsupported walls are connected to the rest of the print on less than two sides.  0.8 mm Support & Overhangs The maximum angle a wall can be printed at without requiring support.  45° Embossed & Engraved Details Features on the model that are raised or recessed below the model surface.  0.6 mm wide &2 00 high Horizontal Bridges The span a technology can print without the need for support.   10 mm Holes The minimum diameter a technology can successfully print a hole.   \u0000 2 mm Connecting/Moving Parts The recommended clearance between two moving or connecting parts.  0.5 mm Minimum Features The recommended minimum size of a feature to ensure it will not fail to print.   2 mm \n\n\n \n22  \nPin Diameter The minimum diameter a pin can be printed at.  3 mm Tolerance The expected tolerance (diameter accuracy) of a specific technology.  ± 0.5% (lower limit ± 0.5 mm) Table 3: Comparative table. [26]   6.3 Introduction to the limitations of FDM technology. Going a little deeper into the FDM technology here we show some of its limitations in detail and propose some methods that can be implemented in the design stage to minimize the impact of these limitations when printing an object.  BRIDGING Bridging in FDM occurs when the printer is required to print between two supports or anchor points. Because there is no support offered for the initial layer being printed (there is nothing to build upon) and it is required to “bridge” a gap, the material will tend to sag. Bridges occur most often in horizontal axis holes found in the walls of objects or in the top layer (or roof) of hollow parts. One solution to reduce the impact of bridging is to reduce the distance of the bridge, but this will depend upon the design constraints of the part. Another solution to avoid sagging is to include support. Support offers a temporary build platform for the bridging layer to be built upon. The support material is then removed once the print has been completed. This can leave marks or damage upon the surface where the support was connected to the final part.  VERTICAL AXIS HOLES FDM will often print vertical axis holes undersized. The general process for printing a hole diameter and the reason the reduction in diameter occurs is: 1. As the nozzle prints the perimeter of a vertical axis hole, it compresses the newly printed layer down onto the existing build layers to help improve adhesion. 2. The compressing force from the nozzle deforms the extruded round layer shape from a circle into a wider and flatter shape (see image below). 3. This increases the area of contact with the previously printed layer (improving adhesion), but also increases the width of the extruded segment. 4. The result of this is a decrease in the diameter of the hole that is being printed. This can be of particular issue when printing small diameter holes where the effect is greater due to the ratio of hole diameter to nozzle diameter. The amount of undersize will depend on the printer, the slicing software, the size of the hole, and the material. Often, the reduction in diameter of vertical axis holes is accounted for in the slicing program, but accuracy can vary and several test prints may be needed to achieve the desired accuracy. If a high level of accuracy is required, drilling the hole after printing may be required.  \n\n\n \n23  \nOVERHANGS Issues with overhang are one of the most common print quality problems relating to FDM. Overhangs occur when the printed layer of material is only partially supported by the layer below. Similar to bridging, the inadequate support provided by the surface below the build layer can result in poor layer adhesion, bulging or curling. An overhang can usually be printed with no loss of quality up to 45 degrees, depending on the material. At 45 degrees, the newly printed layer is supported by 50% of the previous layer. This allows sufficient support and adhesion to build upon. Above 45 degrees, support is required to ensure that the newly printed layer does not bulge down and away from the nozzle. Another issue that occurs when printing overhangs is curling. The newly printed layer becomes increasingly thinner at the edge of the overhang, resulting in differential cooling causing it to deform upward.  CORNERS Because the printing nozzle in FDM is circular, corners and edges will have a radius that is equal to the size of the nozzle. This means that these features will never be perfectly square. For sharp edges and corners, the first layers of a print are particularly important. As discussed above for vertical holes, as the nozzle prints each layer, it compresses the print material down to improve adhesion. For the initial print layer, this creates a flare often called an “elephant's foot”. This can impact the ability to assemble FDM parts as this flare protrudes outside the specified dimensions. Another issue that is often present relating to the first print layer of an FDM print is warping. ABS is more vulnerable to warping due to its high printing temperature when compared to PLA. The base layer is the first layer to be printed and cools as the other hot layers are printed on top. This causes differential cooling and can result in the base layer curling up and away from the build plate as it shrinks and contracts. The addition of a chamfer or radius along the edges of the part that are in contact with the build plate will reduce the impact of these problems. This will also assist in removal of the component from the build plate once the print has been completed.  VERTICAL PINS Vertical pins are often printed in FDM when assembly of parts or alignment is required. Considering that these features are often functional, it is important to understand the size of vertical pins that FDM can print accurately. Large pins (greater than 5mm diameter) are printed with a perimeter and infill, affording a strong connection to the rest of the print. Smaller diameter pins (less than 5mm diameter) can be made up of only perimeter prints with no infill. This creates discontinuity between the rest of the print and the pin, resulting in a weak connection that is susceptible to breaking. In a worst case scenario, small pins may not print at all as there is not enough print material for the newly printed layers to adhere to. Often correct printer calibration (optimal layer height, print speed, nozzle temperature etc.) can reduce the likelihood of small pins failing. The addition of a radius at the base of the pin will eliminate that point as a stress concentration and add strength. For critical pins smaller \n\n \n24  \nthan 5mm diameter, an off the shelf pin inserted into a printed hole may be the optimal solution.  ADVANCED DESIGN Several key aspects to consider when printing with FDM are how to reduce the amount of support required, part orientation and the direction the part is built on the build platform. Often, splitting up a model can reduce its complexity, saving on cost and time. Overhangs that require a large amount of support may be removed by simply splitting a complex shape into sections that are printed individually. If desired, the sections can be glued together once the print has been completed.   HOLE ORIENTATION Support for holes is best avoided by changing the print orientation. Removal of support in horizontal axis holes can often be difficult, but by rotating the build direction 90 degrees, the need for support is eliminated. For components with multiple holes in different directions, prioritize blind holes, then holes with the smallest to largest diameter, then criticality of hole size.  BUILD DIRECTION Due to the anisotropic nature of FDM printing, understanding the application of a component and how it is built are critical to the success of a design. FDM components are inherently weaker in one direction due to layer orientation. [27]    7. EXAMPLE In this chapter it is intended to show, by a real example, all the steps to follow for, starting from a model or digital file, getting a real printed piece. The example shown hereunder is about a heritage reproduction project. It arises from the need to make certain pieces of the Museum of Natural History of Valencia accessible to blind people. Specifically, the project is about the lower part of a tiger jaw. The project begins with the 3D scanning of the original jaw, getting a digital model then. This example will begin from this point.  \n\n \n25  \n Figure 12: Digital model, result of the 3D scanning. [28] Whatever it is the file format, it has to be exported to STL, as it has been shown in other chapters of this guide. As it can be seen almost simple sight in the previous Figure, the model has several errors that need to be repaired, like the teeth part, for example. For that, several software can be used. The process of analysis and repairing will be explained here with free-access software. For example: Meshmixer, from Autodesk. Before seeing the process of analysis and reparation of a STL model, it is noted that, this model under consideration was processed by a certain software (Meshlab, specifically) in order to reduce the file size. The model mesh had a very high and excessive number of triangles, so this number was lowed and hence, the file size. This is a step that just a few times is necessary to implement, so it is just mentioned. For further information about how to reduce the number of triangles of a mesh, and hence the size file, the following link is provided: https://www.shapeways.com/tutorials/polygon_reduction_with_meshlab So, as it was said before, the STL model will be opened with Meshmixer, by clicking on Import. The first thing that can be seen is that the model orientation could not be the adequate one. There is no need to be worry about that. Meshmixer allows you to change it by clicking on Edit > Transform. In addition, we will not print by Meshmixer, so orientation has been adjusted approximately, as can be seen here:  \n Figure 13: Positioning the model in Meshmixer. [29] \n\n\n \n26  \nThereupon, a general analysis of the defects of the piece is made. For that, Inspector option is used, in Analysis section. Meshmixer detects and shows all the errors in the model or file. The different mistakes are shown in different colours, and they are shown by balls and arrows. Holes in the mesh are displayed in blue, non-manifold points or edges are displayed in red, and disconnected components or elements with a very little area are displayed in magenta. There are two options now, either repairing the errors one by one by clicking on the \"ball\", or either clicking on Auto Repair All and repairing everything at once.  \n Figure 14: General analysis in Meshmixer. [30] In this case, the software repairs all the found defects automatically. If not, it is possible to use other software and implement other analysis and reparation process. With Meshmixer it is also possible to perform other kind of analysis such as: thickness, stability, orientation and positioning on the printing base, etc. So, at this point, the STL model is completely repaired and it is ready for the next step. As it can be seen, the program has closed every hole in the mesh, and it has repaired all the defects. It is noted that the software does these reparations automatically, trying to get close, more or less, to the geometry around the defect. If holes or gaps in the mesh are intended to be repaired with a certain geometry it is needed to use a digital sculpture software. It is true that Meshmixer has a digital sculpture option, but it will not be explained in this example, because it is not an objective of this guide.  \n\n\n \n27  \n Figure 15: Jaw with repaired holes and defects. [31] So now, in Meshmixer, the repaired and fixed model must be exported or saved again in STL format. The next step is to load the file in a software that allows to do, at least, the following things: - Choosing an orientation in the printing bed. Rotating and moving the model. - Scaling the model. - Choosing the quality or layer height. - Choosing the infill. Density among other issue. - Generating the needed support structures. In addition, with this software the G-Code or machine code will be also generated. There is different free software for doing this. For example, Ultimaker Cura or Slic3r. In this example Cura is used. So, in Cura the repaired model is imported. To configure the software in order to show the printing bed of the machine now is convenient. Cura has a very big data base of commercial 3D printers. If the used machine is not in that data base, it is also possible to create it from scratch. This model is going to be scaled to 60%. 0.2 mm. is the chosen layer quality. A grid infill of 15% density is also chosen. Automatically support structures will be generated everywhere, and in order to get a good adhesion for the first layer, \"first layer speed\" will be set to 20 mm/s. working material is also chosen: PLA. Finally, the G-Code is saved in the device to insert in the printer by clicking on \"Save to File\".  \n Figure 16: Model loaded and configuration and parameters of the model in Cura. [32] \n\n\n \n28  \nAt this point, it is possible to go to the next step of the process: 3D printing itself. It is needed to go to the machine and, by the appropriated means, to launch the print job. The machine will be left working, and it is recommended to see it from time to time in order to see if everything goes correctly. It is important to say that it is highly recommended to check if the first printed layer is correctly stick to the bed or platform. If not, the following guide is provided: https://www.simplify3d.com/support/print-quality-troubleshooting/#print-not-sticking-to-the-bed In the next picture the printing sequence is shown, for the given example:  \n Figure 17: Jaw printing sequence. [33] The next step is, obviously, to extract the printed piece. A spatula with rounded edges is used, in order not to scratch and not to damage the printing platform. Once the piece has been extracted of the platform, it is time for the post-processing step, consisting on manually and mechanically removing the support structures, and sanding those parts of the piece that have marks (from support structures, for example). The printing bed should be correctly cleaned for the next print job... As mentioned, to sand the marks of the support structures, among others, is very convenient. At the end, the final result of the piece is the following one:  \n\n\n \n29  \nFigure 18: Final result. [34]  If the result at any point of the printing process, or at the end of the printing process is not good, or some errors and shrinkages are seen, the following guide can be very helpful, in order to configure some printing parameters or parameters of the printer: https://www.simplify3d.com/support/print-quality-troubleshooting/\t\t\t\t\t\t\t\t\t\t\t\tSOURCES\t\t[1] What is Additive Manufacturing? Source: https://www.3dhubs.com/what-is-3d-printing \nThis\tguide\tis\ta\tsummary\tof\tthe\tdocument\tIO1/A1\tTransfer\tof\tknowledge\tabout\tbasics\tof\t3D\tprinting\tconcepts\tto\tthe\tVET\tTeachers.\t \n\n \n30  \n[2] Scheme 1: Processes and manufacturing techniques. Source: KIT [3] How does 3D printing work? Source: https://www.createeducation.com/about-us/introduction/ [4] Figure 1: 3D printing process. Source: KIT [5] Rapid prototyping technology for the development of new products. 2016. Source: http://ijiset.com/vol3/v3s1/IJISET_V3_I1_39.pdf  [6] Figure 2: FDM Technology. Source: https://i.materialise.com/blog/3d-printing-technologies-and-materials/ [7] F. Kunz, A. A. Jorg, L. Chaabane: Innovation Infrastructure& Services. Switzerland Innovation Park Biel.  2017. [8] FDM Prints. 2017. Source: https://www.sculpteo.com/en/glossary/fdm-fused-deposition-modeling-definition/ [9] Surface modification of fused deposition modeling ABS to enable rapid prototyping of biomedical microdevices. 2013. Source: http://www.sciencedirect.com/science/article/pii/S092401361300006X [10] Scaffold Design and in Vitro Study of Osteochondral Coculture in a Three-Dimensional Porous Polycaprolactone Scaffold Fabricated by Fused Deposition Modeling. 2004. Source: http://online.liebertpub.com/doi/abs/10.1089/10763270360697012 [11] Scheme 2: Production process in 3D printing. Source: CETEM [12] Figure 3: Support structures. Source: https://www.geeky-gadgets.com/wp-content/uploads/2015/01/Form-1-3D-Printer-Update1.jpg  [13] Figure 4: Different types of support structures. Source: http://www.reppersdelight.spacymen.com/public/RD_images/MeshMixer_support3.jpg https://i.ytimg.com/vi/GThbJZZvRFY/maxresdefault.jpg https://www.simufact.com/files/Medien/_2Produkte/2.3_Simufact_Additive/Support-settings_more_support.png [14] Figure 5: Different infill percentages. Source: http://my3dmatter.com/wp-content/uploads/2015/03/infillpercentimage.png https://3dplatform.com/wp-content/uploads/2015/08/3DP-Infill-Percentage-1024x745.jpg Different infill patterns. Source: https://i.ytimg.com/vi/BMWTK2ZgJCM/maxresdefault.jpg https://assets.pinshape.com/uploads/image/file/98145/container_display-tray-for-infill-pattern-and-infill-density-3d-printing-98145.jpg [15] Figure 6: Two different layer heights. Source: http://wiki.ikaslab.org/images/thumb/8/8c/Altura_de_capa.jpg/700px-Altura_de_capa.jpg \n\n[Примечание: документ содержит 31 страниц, обработано 30]",
    "url": "",
    "section": "Документация",
    "problem_type": null,
    "printer_models": [],
    "materials": [],
    "symptoms": [],
    "solutions": [],
    "abstract": "",
    "relevance_score": 0.9,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "D:20190222144507Z00'00'",
    "author": "",
    "images": []
  },
  {
    "id": "7182135736353389047",
    "title": "Как устранить stringing (сопли) при печати PLA",
    "content": "Stringing (сопли) - это проблема, когда между деталями появляются тонкие ниточки пластика.\n\nПричины:\n- Слишком высокая температура сопла\n- Недостаточная retraction\n- Слишком медленная скорость retraction\n\nРешения:\n1. Уменьшите температуру сопла на 5-10°C\n2. Увеличьте retraction до 6-8 мм\n3. Увеличьте скорость retraction до 45-60 мм/с\n4. Включите функцию \"Wipe\" в настройках слайсера\n\nЭти настройки подходят для большинства принтеров с прямым экструдером (Ender-3, Prusa i3).",
    "url": "https://3dtoday.ru/blogs/test/stringing-pla",
    "section": "Техничка",
    "problem_type": "stringing",
    "printer_models": [
      "Ender-3",
      "Prusa i3"
    ],
    "materials": [
      "PLA"
    ],
    "symptoms": [
      "тонкие ниточки пластика",
      "сопли"
    ],
    "solutions": [
      {
        "parameter": "nozzle_temperature",
        "value": "-5-10",
        "unit": "°C",
        "description": "Уменьшите температуру сопла на 5-10°C"
      },
      {
        "parameter": "retraction_length",
        "value": "6-8",
        "unit": "mm",
        "description": "Увеличьте retraction до 6-8 мм"
      },
      {
        "parameter": "retraction_speed",
        "value": "45-60",
        "unit": "mm/s",
        "description": "Увеличьте скорость retraction до 45-60 мм/с"
      },
      {
        "parameter": "wipe",
        "value": true,
        "unit": null,
        "description": "Включите функцию \"Wipe\" в настройках слайсера"
      }
    ],
    "abstract": "",
    "relevance_score": 1.0,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "",
    "author": "",
    "images": []
  },
  {
    "id": "7650887112816190748",
    "title": "Microsoft Word - IO1_A1_Transfer of knowledge about basic of 3D printing concepts to the VET teachers - ShortVersion - NewTemplate.docx",
    "content": " \t\t\nIO1 – Methodology for defining 3D printing exercises suitable for transversal education    3D PRINTING TECHNICAL GUIDE - SUMMARY -    - O1A1- Transfer of knowledge about basics of 3D printing concepts to the VET teachers.  \n\n \n2  \nERASMUS3D+ For the immersion in 3D printing of VET centres.  Project Agreement Number  2017-1-DE02-KA202-004159  This work is licensed under  https://creativecommons.org/licenses/by-nc-nd/4.0/   PARTICIPANT ORGANIZATIONS      Disclaimer:  \"The European Commission support for the production of this publication does not constitute an endorsement of the contents which reflects the views only of the authors, and the Commission cannot be held responsible for any use which may be made of the information contained therein.\"   Output Identification O1 Output Title IO1 – Methodology for defining 3D printing exercises suitable for transversal education Output Description O1 – A1.  Transfer of knowledge about basic of 3D printing concepts to the VET teachers. Version v.1.1 (Short Version) \t\t\t\n\n\n \n3  \nINDEX SCHEMES INDEX............................................................................................................................... 4 TABLES INDEX .................................................................................................................................. 4 1. INTRODUCTION TO ADDITIVE MANUFACTURING. .................................................................... 5 1.1 What is Additive Manufacturing?...................................................................................... 5 1.2 How does 3D printing work? ............................................................................................. 5 1.3 What is Rapid Prototyping? .............................................................................................. 6 2. FUSED DEPOSITION MODELING (FDM). .................................................................................... 7 3. PRODUCTION PROCESS IN 3D PRINTING ................................................................................... 8 3.1. Obtaining the digital model: ............................................................................................. 9 3.2. Exporting and repairing the STL file:................................................................................ 10 3.3. Testing, orientation, distribution and G-Code: ................................................................ 10 3.1.1. Analyzing the piece or model: ................................................................................. 10 3.1.2. Support structures: ................................................................................................. 11 3.1.3. Model infill: ............................................................................................................ 12 3.1.4. Positioning and orientation ..................................................................................... 12 3.1.5. Generating the G-Code. .......................................................................................... 13 3.4. 3D printing: .................................................................................................................... 14 3.5. Extracting pieces: ........................................................................................................... 14 3.6. Post-processing: ............................................................................................................. 15 4. SOFTWARE THAT YOU NEED FOR 3D PRINTING ...................................................................... 16 4.1 Programmes for designing .............................................................................................. 16 4.2 Programmes for testing, orientating and repairing.......................................................... 17 4.3 Programmes for generating the G-code .......................................................................... 18 4.4 3D Printing Workflow ..................................................................................................... 18 5. 3D PRINTING MATERIALS ....................................................................................................... 19 5.1 Overview ........................................................................................................................ 19 5.2 FDM 3D Printing Materials .............................................................................................. 19 6. LIMITATIONS OF PRINTED OBJECTS. ....................................................................................... 20 6.1 Limitations of additive manufacturing and 3D printing. ................................................... 20 6.2 FDM limitations table. .................................................................................................... 21 6.3 Introduction to the limitations of FDM technology. ........................................................ 22 7. EXAMPLE................................................................................................................................ 24  \n\n \n4  \nFIGURE INDEX Figure 1: 3D printing process. ........................................................................................................... 6 Figure 2: FDM Technology................................................................................................................ 7 Figure 3: Support structures. .......................................................................................................... 11 Figure 4: Different types of support structures. .............................................................................. 12 Figure 5: Different infill percentages and patterns.......................................................................... 12 Figure 6: Two different layer heights. ............................................................................................. 14 Figure 7: Extraction. ....................................................................................................................... 15 Figure 8: Mechanical process and bath for removing the support structures. ................................. 15 Figure 9: Different finishing. ........................................................................................................... 16 Figure 10: Process to develop a 3D Model. ..................................................................................... 16 Figure 11. Diagram 3D Printing Workflow. ..................................................................................... 18 Figure 13: Digital model, result of the 3D scanning. ........................................................................ 25 Figure 14: Positioning the model in Meshmixer. ............................................................................. 25 Figure 15: General analysis in Meshmixer. ..................................................................................... 26 Figure 16: Jaw with repaired holes and defects. ............................................................................. 27 Figure 17: Model loaded and configuration and parameters of the model in Cura. ......................... 27 Figure 18: Jaw printing sequence.] ................................................................................................. 28 Figure 19: Final result. .................................................................................................................... 29  SCHEMES INDEX Scheme 1: Processes and manufacturing techniques........................................................................ 5 Scheme 2: Production process in 3D printing ................................................................................... 9   TABLES INDEX Table 1: Software to Designing a 3D Model .................................................................................... 17 Table 2: Software to Testing, Orientating and Repair a 3D Model ................................................... 18 Table 3: Comparative table. ........................................................................................................... 22                  \n\n \n5  \n1. INTRODUCTION TO ADDITIVE MANUFACTURING.  1.1 What is Additive Manufacturing? Additive manufacturing or 3D printing (commonly called) is a process that creates a physical object from a digital design. There are different 3D printing technologies and materials you can print with, but all are based on the same principle: a digital model is turned into a solid three-dimensional physical object by adding material layer by layer. [1] It is important to point out from the beginning that Additive Manufacturing does not constitute a single technology but a set of manufacturing processes, very different from each other, that share three common characteristics: 1. They are manufacturing processes by addition of material to construct a solid three-dimensional object.  2. The object is constructed by superimposing successive layers of material. 3. The object is made from a digital 3D model.  They are called ADITIVE Manufacturing processes to differentiate them from conventional processes. Together with these, they are part of the set of processes available to the Industry.  Some of the most used additive manufacturing technologies that best suits to the educational area will be described in the following point of this guide. These technologies are: Fused Deposition Modeling (FDM), Stereolithography (SLA) and Selective Laser Sintering (SLS).    1.2 How does 3D printing work? It all starts with making or obtaining a virtual design of the object you want to create. This virtual design can be made in a CAD (Computer Aided Design) file using a 3D modeling program (for the creation of a totally new object) or with the use of a 3D scanner (to copy an existing object). A 3D scanner makes a 3D digital copy of an object.  There are also lots of online file repositories where you can download existing 3D files that will help get you started. \nPROCESSES AND MANUFACTURING TECHNIQUES\nSubtractive Manufacturing. \nForming Process (SPF)\nAdditive Manufacturing\nJoining process\nScheme 1: Processes and manufacturing techniques. [2] \n\n \n6  \nThe 3D printing process turns an object into many, tiny little slices, then builds it from the bottom up, slice by slice. The layers then build up to form a solid object. [3] \nSome advantages of Additive Manufacturing compared to conventional processes: • Fewer steps between the CAD model and the production of the part. • Generally, few human resource requirements due to a high level of automation. • A large number of geometrical forms can be manufactured, enabling for instance the production of parts which are topologically optimized, with internal channels, etc. • High-speed manufacturing for small, complex parts. • Generally, less material wastage. • Possibility to reconstruct damaged sections of existing objects, depending on the part material • No special tooling required.  1.3 What is Rapid Prototyping? Rapid prototyping is an automated process that quickly builds physical prototypes from 3D CAD files composed of surface quality or solid models. Any manufacturing process can be classified as either subtractive, formative or additive. Every manufacturing process either falls completely into one of these categories, or is a hybrid process falling into more than one. In the manufacturing arena, productivity is achieved by guiding a product from concept to market quickly and inexpensively. Rapid prototyping technology aids this process. [5] It is important not to confuse rapid prototyping with 3D printing or with additive manufacturing, because the concepts are used interchangeably and wrongly many times. We can say that additive manufacturing is one of the technologies with which we can produce a rapid prototyping product.  It is convenient to underline that every technology and every process has a starting point in common: computer aided design (CAD).   DesignSTL fileOBJ file...\nG-Code\n3D Print\n3D Object\nFigure 1: 3D printing process. [4] \n\n \n7  \n2. FUSED DEPOSITION MODELING (FDM). Home printers typically work with plastic filament. The technology behind this is often referred to Fused Deposition Modeling (FDM) is a 3D printing technology that works by extruding a thermoplastic polymer through a heated nozzle which gets deposited on a building stage. FDM is also considered to be a form of additive manufacturing, which at the same time is a “process of joining materials to make objects from 3D model data, usually layer upon layer”.  The mere process involves a plastic filament which is fed by a spool to the nozzle where the material is liquefied and “drawn” on the platform. As soon as it touches the build stage, the filament hardens while being gradually deposited, following a certain structure, in order to create the final 3D print. When a layer is drawn, the platform lowers by one-layer thickness so that the printer is able to start working on the next layer.  \n  There are many different materials which can be used with FDM. The most commonly used are ABS (Acrylonitrile Butadiene Styrene), PLA (Polylactic Acid) and Nylon (Polyamide), but other exotic varieties of materials can also be used, like a material blend of plastic and wood or carbon. [7] Because this technology presents some very good pros, FDM is often used in the area of non-functional prototypes in order to produce concept parts, functional models, prototypes in general, manufacturing tooling and modeling, and end use parts. More specifically, FDM can be used for low-volume production and prototypes aimed at form, fit and function tests.  At the same time, it is most commonly used in the aerospace sector, for example, to produce wind turbines. Anatomical models for medical use are also very much suitable to be built with this technology. Finally, FDM has slowly been enabling the rapid prototyping of biomedical micro devices, the kind of devices that are used on a daily basis in hospitals, for example, therefore very much fundamental, as it is considered both cheap, but at the same very safe. [8] When it comes to 3D printing technology, one of the very first concerns relate to its cost. While in general it is the long-term use of materials that can become a serious expense, \nFigure 2: FDM Technology [6] \n\n \n8  \nthose who want to engage with Fused Deposition Modeling have an advantage from the start; in fact, FDM printing machines are among the cheapest and most affordable especially for those who want to use it in a domestic environment. [9] As for accuracy, the 3D prints do not reach the same level of accuracy and quality of other items which are instead produced through the use of Stereolithography. That said, the result is considered to be fairly qualitative, depending on the sector where the technology is applied. Resolution depends mainly on the size of the nozzle that is used. The precision of the machine is dependent on the extruder movements on the X and Y axis, but there are other factors to be taken into consideration. For example, the bonding force between the layers is lower than in the Stereolithography process. Consequently, the weight of the layers might squeeze the lower layers, which can therefore influence and even compromise the quality of the 3D print. [10]    3. PRODUCTION PROCESS IN 3D PRINTING Hereunder, in this chapter, all the necessary processes and steps for, starting with a digital design, obtaining a real printed piece, are going to be described. It is important to mention that there is not just a single valid process for printing three dimensional pieces. What is explained in this guide are a certain number of steps that should be adapted to the type of piece, selected technology, type of machine, and even to the used software. Furthermore, the process that is described hereunder is mostly intended for fused deposition modelling (FDM) 3D printers. In the production process for 3D printing, experience, piece features, used machine, etc. have a lot of weight. It is for sure that someone with little or without experience will 3D print a lot of piece with failures, before he finds the key. The production process, in a generally speaking, is the following: \n\n \n9  \n 3.1. Obtaining the digital model: There are several possibilities for obtaining the 3D model or digital model that is wanted to print. In particular, there are three possibilities: • To model the piece using a CAD software: With this first option, in order to get the three-dimensional model, a computer aided design (CAD) software must be used. There are a lot of available CAD software for modelling, and there is not a best option; it will depend on the user and their abilities with the software.  • To obtain the geometry by Reverse Engineering and 3D scanners: By this option a 3D scanner is used to digitally obtain the geometry of a real object. This is not a simple process and some ability and experience is required. In addition, there are several types of 3D scanners, and they are usually expensive. The reverse engineering process usually is for copying, improving, or customizing real objects, or also for incorporating complex surfaces to a 3D modelled piece.  • Downloading the model from repositories or asking someone to design it for you: If you do not have knowledge in computer-aided 3D design, or you do not have the necessary equipment (or software, or even knowledge) for applying a process of reverse engineering, to download the model from a repository or to ask somebody to design it for you is the best option. Depending on whether the repository is a 3D printing model repository (e.g.: Thingiverse) or a more general digital model repository (e.g.: GrabCAD), the downloaded model will be ready for 3D printing or it will be not. \nScheme 2: Production process in 3D printing [11] \n\n \n10  \nIn the next tutorial it can be seen a range of CAD design tips for 3D printing, depending on the material selected: https://www.sculpteo.com/en/materials/materials-design-guidelines/ And in the next link it can be found more information and more tutorials about how modelling and preparing a piece for being 3D printed by different CAD software: https://www.sculpteo.com/en/tutorial/  3.2. Exporting and repairing the STL file: When you work designing and printing 3D models, a wide range of formats or types of files are available. Some of them are thought for designing or scanning, but others are associated to 3D printing, such as: STL, OBJ, PLY or FBX, among others. Depending on the modelled piece, on the software, on the 3D printer features, etc., one or another format must be used. In this guide, in order to unify criteria, it is explained how to export and use the STL file. When the piece is designed and modelled, a format conversion to the \".stl\" file is needed. If the piece has been downloaded from a repository, this conversion is frequently already done. However, if free or commercial CAD software has been used this conversion is needed. Normally, exporting a CAD design to STL format is as simple as going to the used software menu and clicking on \"Save as...\" or in \"Export\" and choosing STL. Sometimes, there are problems during conversion to STL, either because the model is not thought for 3D printing, either because the design in the CAD software has not being made correctly, or either other causes. So, the exported model may have some errors. These errors are of various kinds: holes or gaps, reversed triangles, duplicated faces or triangles, faces or triangles that intersect, singular points or faces (out of the model), etc. The digital model reparation is explained in the next step of the production process in 3D printing, because it is very linked to the implementation of analysis to the pieces.  3.3. Testing, orientation, distribution and G-Code: This stage of the production process in 3D printing is about the preparation of the pieces or digital models (previously exported to STL) for being 3D printed. It is about performing the next process, orderly:  3.1.1. Analyzing the piece or model: The analysis usually is necessary when pieces are relatively complex, or when the origin of the pieces is not known, or it can be done just if you want to be one hundred per cent that the piece is suitable for being 3D printing. In addition, a good analysis can detect errors in the triangle mesh arisen from the STL conversion. These analysis can be implemented by some software, that also is useful for other purposes or not. Implemented analysis of: - Thickness: Recommended thickness depends on the 3D printing machine (and frequently on the used technology). Some machines allow to bigger thickness than others. To search the specific machine and to see the allowed thickness should be enough. Generally speaking, for fused deposition modelling (FDM) machines, \n\n \n11  \nthickness about 1 millimetre should be considered, approximately. This parameter must not be confused with layer thickness. - Holes or gaps: The model want to be printed must be perfectly closed, or best said: it must be watertight. This means that the triangular mesh must not have holes or gaps, or what is the same, it must not have vertex or triangle points not joined; every of them must be connected to other triangles. - Angles and overhang:  By this analysis it can be found, depending on the selected technology and machine, if the model or piece will need of support structures for being printed. Generally, for FDM printers the minimum allowed inclination angle is 45 degrees. Finally, it is noticeable that many of the used programs for analysing the piece allow, not just to detect errors or problems, but also allow to repair, or what is best, auto repair the model.  3.1.2. Support structures: For some technologies, it is necessary that, in order to beat gravity and to print overhang parts (or with internal gaps), support structures are inserted on this zones. They are usually necessary from 45 degrees (for FDM printers).   Figure 3: Support structures. [12] Support structures are usually done by the same material as the piece, although there are 3D printers that print two materials: piece's one and support structures one. With these printers soluble support materials in certain liquids can be used. As support structures are thought just for holding the first layers of the model that are cantilevered or \"floating\", support structures are built lightly and using less material than for the piece itself. In addition, they will not mark so much the piece, when they are removed. Most of the available software, either analysis software or either the own software of the printer machine, allow two options: making a design of the support structures, or automatically calculating and inserting these structures. A good guide for designing, using and calculate how and when using supports can be found in the following link: https://www.3dhubs.com/knowledge-base/supports-3d-printing-technology-overview. \n\n\n \n12  \nFigure 4: Different types of support structures. [13] 3.1.3. Model infill: When we talk about the infill it is about the structure printed inside the object. It means, if we think in the example of a cube, the six external walls will be printed in a solid way, with a certain thickness, but the internal part of the cube will not be solid; you will have to choose the infill percentage, and even the geometrical shape of the infill. The geometrical pattern of the infill can be also chosen. Some of them are more resistant than others, but generally, the default pattern of the software can be selected. Percentage and pattern shape will be chosen according to several aspects: total weight of the piece, used material, resistance to be achieved, printing time and sometimes decorative features. In general, the greater the infill percentage, the stronger the printed piece will be, but the longer will take to be printed. A percentage about 15% usually is enough. Hereunder some examples can be seen (on software and on printed pieces):  \n Figure 5: Different infill percentages and patterns. [14] 3.1.4. Positioning and orientation To decide the position and orientation of the piece on the printing surface or printing bed is one of the most important part of the whole process. It is a decision that will have a great impact on the piece quality and properties. \n\n\n \n13  \nOne of the most used criteria for choosing position and orientation is using the minimum amount of material (and spending less printing time). This is achieved by minimizing overhang parts. Consequently, less support structures will be printed and the piece will be built in less time. However, sometimes quality to achieve is more important, so that orientations that are not optimal in terms of material and printing time, can be chosen. Some tips, in a general way, are: • To center the pieces in the printing surface or bed surface. This will reduce the movements of the printing head (and, consequently, the printing time). Furthermore, it will increase the quality and precision of the piece, because printing platforms are usually more leveled and calibrated in its central part, and also because if they are heated, heat is greater in the central part. • If there are curved or sloped surfaces, and these parts of the piece are desired to be printed with quality, piece should be positioned so that these surfaces are positioned on XY plane (horizontal plane), or as parallel as possible to this plane. So \"stair-stepping\" effect will be avoided, in which curved or sloped surfaces are not smooth. • Watching the previous picture, if the piece has an inner hole, or a through hole, it would be adequate to put this hole with its axis perpendicular to the printing bed, if a great quality is required in the hole surface. • A very long and plane section printed on the horizontal plane or XY plane may suffer deformation, which means that its outer borders get cold and shrink very quick, causing the piece to warp upwards. Sometimes, to print these pieces so their longest section is perpendicular to the building plate is convenient. • In a general way, the top surface of a printed piece will have the best finishing. • If we are printing functional pieces, that have to withstand forces and loads, it is much more likely for them to de-laminate and to break when the forces or loads are perpendicular to the layers direction.  3.1.5. Generating the G-Code. Once all the previous steps have being developed, it is time to generate what is known as G-Code or machine code. This code is the translation of the piece (and all the parameters that have been previously set) into instructions that the machine can understand. Before that, depending on the used software, it is necessary to choose the layer height or layer thickness. This parameter has also a lot of importance and it will have a great impact on the final quality of the surface of the piece. A higher layer height will result on a great resolution or quality, but also will result on a greater printing time. It is quite important to understand what is more important: aesthetics or a quick and cheap printing. Sometimes, differences between two identical pieces, but with layers height of 100 microns and 200 microns are hard to distinguish. But the 100 microns piece will take the double to print and will cost more. Therefore, it is very important to know what is the final use of a piece. It is also crucial to know the amount of curves and angles of the piece, because the layers height is more visible on these parts than on straight walls.  \n\n \n14  \n Figure 6: Two different layer heights. [15] To sum up with the layer height matter, it is noticeable that for each machine and technology a certain range of layer height values is available to be chosen. For example, for FDM, a very common range is from 50 to 300 microns (0.05 to 0.3 millimetres). So, at this point the G-Code must be generated, and this can be done by various software. Probably, some of the programs to be used may have already be used in a previous step. The program cuts the model into horizontal \"slices\" or layers, generating the path that the machine head will follow. It also calculates the amount of material (weight and metres) and the estimated printing time. With the chosen program, the G-Code is exported and saved, in a SD card or in a pen drive. Or it can be also directly sent to the machine, depending on the software and machine. To sum up this part, it should be taken into account that there are a lot of parameters that can be changed: wall thickness, printing speeds, printing temperatures and bed temperature, flow, etc. But these are parameters to edit by users with experience, and it is advisable to let them default.  3.4. 3D printing: Now the G-Code has being obtained the process of 3D printing can be implemented. There are a few things to consider and to check before printing. For FDM printers, the temperatures of the bed or printing platform and of the extruder must to be checked (the software or the printer do that automatically when you start to print). To use some kind of lacquer or varnish is also recommendable in order to ease the extraction of the piece. It is advisable to read the instructions to also know how to load the filament on the printer for example, and for further information. Therefore, the G-Code is sent to the machine, and the machine starts to work.  3.5. Extracting pieces: When the printer has already finished, it is the moment to implement the process of extracting the piece/s. Once again, depending on the machine and mainly, on the technology and used materials, the extraction processes will vary. For fused deposition modelling machines (FDM), pieces often are removed by hand, or with some tool like a blade. It is also possible to have flexible platforms that ease a lot the extraction. There are even other methods such as using a solvent, or applying cold or with dental floss.  \n\n\n \n15  \n Figure 7: Extraction. [16]  3.6. Post-processing: For a lot of pieces, a finishing process is needed, that once again varies along the kind of technology and kind of machine. For some technologies and machines this process is necessary.  First of all, it is important to note that some of the printed pieces may not need a post-processing step. Or maybe some of them will need just to remove mechanically the support structures. There are a lot of finishing processes and post-processes: • Remove support structures: This can be done mechanically, as it has been said, or by the use of a solvent bath (even water), if the printing material is the adequate one.  Figure 8: Mechanical process and bath for removing the support structures. [17] [18] • Sanding: It is a process to apply when the support structures have been already removed. Several sanding grades can be chosen. • Polishing: If the piece is wanted to have a \"mirror-like\" surface it is necessary to polish the piece. It is needed to sanding the piece with a sandpaper of number 2000, previously. Then, the powder should be cleaned and the piece will be polished with a microfiber cloth and a special enamel, which will produce a lasting shine. There are also rotary sanders and polishers. • Coatings: All the pieces are capable of applying a coating. In the case of paints, it is advisable to apply first a coat layer and then to paint with aerosol, acrylics or airbrushes. Epoxy gels, metal coatings, etc. are also available. \n\n\n \n16  \n Figure 9: Different finishing. [19] There are more finishing processes: shot blasting, smoothing with acetone vapour... For knowing more post-processes for FDM technology the following link is provided: https://www.3dhubs.com/knowledge-base/post-processing-fdm-printed-parts    4. SOFTWARE THAT YOU NEED FOR 3D PRINTING There are different software for each form of creation of the 3D object, as well as for each phase of the process. To know which software you have the most affinity and meets your needs, you have to study and evaluate which one is most appropriate for your workflow and your technical level. The process for obtaining the 3D object is composed of 3 phases: Designing the 3D object, Repairing/Generating of the G-Code and Printing.  \n Figure 10: Process to develop a 3D Model. [20]  Some software are capable of doing the whole process, which means they have tools for 3D object creation, verification and repair, until the generation of G-Code. Below we explain the software available for creation of 3D object; they are divided into 3 groups.  4.1 Programmes for designing There are three ways to create the 3D object: Modelling, Scanning and Downloading repositories that are already available online.  \n\n\n \n17  \nModelling  Many programmes can be used to create or draw a 3D Model since the beginning. They have different levels of complexity, also different licenses. To choose which of them meets your work needs and fits to your abilities, we list them below, with a brief description and links, that you can you to know more about them.  \n Table 1: Software to Designing a 3D Model. [21] Scanning: By using 3D scanning you will be able to capture a digital copy of a physical real world object. Different technologies are able to scan an object to create a 3D Model, as example: time-of-flight, structured / modulated light, volumetric scanning etc. Some scanners are listed here: Downloading  The third possibility to have your 3D Model is downloading it from websites of repositories, read to print or that needs a small correction. 4.2 Programmes for testing, orientating and repairing Before you can print your 3D Model, you need to analyse the 3D model. This will show if any part cannot be printed or if there is a failure. Then it is possible to repair, to decrease or increase the triangles that form the surface that will be printed, and to cut the model in parts if necessary. \n\n\n \n18  \nThere are some software available to do this part of the process, below you find a list with the most used:  https://knowledge.autodesk.com/support/netfabb?p=NETF&skill=Beginner&sort=score&page=1&v=2017  http://www.meshlab.net/#support  https://www.mmmanual.com/ Table 2: Software to Testing, Orientating and Repair a 3D Model. [22]   4.3 Programmes for generating the G-code G-code is a language in which people tell computerized machine tools how to make something. The \"how\" is defined by instructions on where to move, how fast to move, and what path to follow. The G-Code can be generated with many different software like Skeinforge, Cura, Slic3r... One of the more used software is Slic3r. It is a necessary tool to convert a 3D model into printing instructions (G-code) for the 3D printer. It cuts the model into horizontal slices (layers), generates toolpaths to fill them and calculates the amount of material to be extruded. It is possible to scale, rotate, split or cut the object, and also to add support.  4.4 3D Printing Workflow \n Figure 11. Diagram 3D Printing Workflow. [23] \nPLATFORM \n\n \n19  \n5. 3D PRINTING MATERIALS  5.1 Overview When it comes to 3D printing, materials are often one of the most important choice. Earlier AM technologies were making use of certain materials which proved to be non-resistant enough and were degrading quickly. With time, the knowledge about 3D printing has been extending and has been spreading all over the world. With more people interested and the idea that this technology has the right potential to lead to new innovative ways of manufacturing, further studies and analysis has been conducted and new materials have been created. Some examples are visible on 3dhubs.com, a portal which provides 3D printing services on a global level [24]: • Prototyping Plastic, suitable for fast and cost-effective prototyping; • High Detail Resin, suitable for intricate designs and sculptures; • SLS Nylon, for functional prototypes and end-use parts; • Fibre-Reinforced Nylon, for engineering strong parts; • Rigid Opaque Plastic, for realistic prototypes with high accuracy; • Rubber-Like Plastic, simulating rubber; • Transparent Plastic, to create see-through parts and prototypes; • Simulated ABS, with high precision and functional moulds; • Full Colour Sandstone, for photo-realistic models; • Industrial Metals, for prototypes and end-use parts.   5.2 FDM 3D Printing Materials For what concerns Fused Deposition Modeling (FDM), some of the most popular materials are: • Thermoplastic Filament  • PLA: Easy to print, very accurate, low melting point, rigid. Good for most things, not for warm/hot regions.  • ABS: Tends to warp, strong and slightly flexible. Used for many mechanical parts.  • PETG: Easy to print & accurate, tends to string, good layer adhesion.  • TPU: Flexible polymer; ok to print, kind of like stiff rubber. Best used with direct-drive machines.  • Nylon: Strong and flexible; special filament for printers exist. Polycarbonate: Obnoxiously strong, high warp, high temp, bad fumes [Paul Chase, 3D Printing 101. 2016.] Concerning ABS and PLA, there is no limit that one can do of them, for example they can be mixed together. They represent a much better solution to using pure plastic material; this is, \n\n \n20  \nin fact, relatively expensive, with a low strength and durability. Final products can usually be distorted easily. Therefore, plastics do not make FDM cost-effective, nor it allows the technology to be applied in functional and load-bearing applications, especially in a large-scale production. ABS filaments, instead, can take a variety of forms and can be engineered to have many properties. Therefore, they are strong, but also very flexible; they can be sanded and machined, plus acetone can be used to gloss the parts through brushing or dipping them in it. A first comparison between ABS and PLA is that the former filaments are much easier to be recycled, another reason why most of engineers would rather prefer using this kind of material.    6. LIMITATIONS OF PRINTED OBJECTS. In this section we aim to show the limitations of both additive manufacturing and 3D printing in general, as well as the particular limitations of each technology, focusing on the technology Fused deposition Modelling (FDM).  6.1 Limitations of additive manufacturing and 3D printing. Despite the obvious advances that this technology can bring to the industry due to its indisputable advantages, there are limitations that make additive manufacturing technologies not widely implemented in many sectors. The current limitations are due both to the AM processes themselves, which can still be improved, as well as to auxiliary processes (previous manipulations of material, post-processing, quality control ...) that in many cases condition their viability. The lack of knowledge on how to design the products and how to reorient the companies to successfully integrate these new technologies also influences. [25] Some of these limitations are the following: Technologies in development: Many of the technologies are in continuous development. Some of them are still in early stages of development. In a few years, a machine may be outdated or outmoded. Availability and cost of the raw material: Getting the supply of materials at some points can be complicated. Also, some materials are quite expensive, if you are looking for very specific properties. The most basic and cheap material is usually plastic. Initial investment: Desktop FDM printers are usually cheap, but for other technologies, especially if larger machine sizes are sought, the initial investment can be very high. Size of the pieces: The size of the pieces to produce depends on the printing bed. While it is true that many large pieces can be chopped and then joined. \n\n \n21  \nNon-profitable mass production: Additive manufacturing and 3D printing are designed for very short series of pieces (around 1 - 10 units). For longer series, production with these technologies is not profitable. Finishes and precision: In general, getting very good finish and very good precision will be expensive. That is to say, it will be necessary to resort to more expensive technologies and machines. In addition, the parts may require post-processes, other machines and special sub-processes. Obtaining digital files: If specific and highly customized pieces are desired, it is necessary to possess advanced CAD design knowledge. Most of the time, the repositories of CAD files are not enough. The same goes for the 3D scanner; they are expensive and using it requires certain knowledge.   6.2 FDM limitations table. LIMITATIONS NAME DESCRIPTION SKETCH FDM Supported Walls Walls that are connected to the rest of the print on at least two sides.  0.8 mm Unsupported Walls Unsupported walls are connected to the rest of the print on less than two sides.  0.8 mm Support & Overhangs The maximum angle a wall can be printed at without requiring support.  45° Embossed & Engraved Details Features on the model that are raised or recessed below the model surface.  0.6 mm wide &2 00 high Horizontal Bridges The span a technology can print without the need for support.   10 mm Holes The minimum diameter a technology can successfully print a hole.   \u0000 2 mm Connecting/Moving Parts The recommended clearance between two moving or connecting parts.  0.5 mm Minimum Features The recommended minimum size of a feature to ensure it will not fail to print.   2 mm \n\n\n \n22  \nPin Diameter The minimum diameter a pin can be printed at.  3 mm Tolerance The expected tolerance (diameter accuracy) of a specific technology.  ± 0.5% (lower limit ± 0.5 mm) Table 3: Comparative table. [26]   6.3 Introduction to the limitations of FDM technology. Going a little deeper into the FDM technology here we show some of its limitations in detail and propose some methods that can be implemented in the design stage to minimize the impact of these limitations when printing an object.  BRIDGING Bridging in FDM occurs when the printer is required to print between two supports or anchor points. Because there is no support offered for the initial layer being printed (there is nothing to build upon) and it is required to “bridge” a gap, the material will tend to sag. Bridges occur most often in horizontal axis holes found in the walls of objects or in the top layer (or roof) of hollow parts. One solution to reduce the impact of bridging is to reduce the distance of the bridge, but this will depend upon the design constraints of the part. Another solution to avoid sagging is to include support. Support offers a temporary build platform for the bridging layer to be built upon. The support material is then removed once the print has been completed. This can leave marks or damage upon the surface where the support was connected to the final part.  VERTICAL AXIS HOLES FDM will often print vertical axis holes undersized. The general process for printing a hole diameter and the reason the reduction in diameter occurs is: 1. As the nozzle prints the perimeter of a vertical axis hole, it compresses the newly printed layer down onto the existing build layers to help improve adhesion. 2. The compressing force from the nozzle deforms the extruded round layer shape from a circle into a wider and flatter shape (see image below). 3. This increases the area of contact with the previously printed layer (improving adhesion), but also increases the width of the extruded segment. 4. The result of this is a decrease in the diameter of the hole that is being printed. This can be of particular issue when printing small diameter holes where the effect is greater due to the ratio of hole diameter to nozzle diameter. The amount of undersize will depend on the printer, the slicing software, the size of the hole, and the material. Often, the reduction in diameter of vertical axis holes is accounted for in the slicing program, but accuracy can vary and several test prints may be needed to achieve the desired accuracy. If a high level of accuracy is required, drilling the hole after printing may be required.  \n\n\n \n23  \nOVERHANGS Issues with overhang are one of the most common print quality problems relating to FDM. Overhangs occur when the printed layer of material is only partially supported by the layer below. Similar to bridging, the inadequate support provided by the surface below the build layer can result in poor layer adhesion, bulging or curling. An overhang can usually be printed with no loss of quality up to 45 degrees, depending on the material. At 45 degrees, the newly printed layer is supported by 50% of the previous layer. This allows sufficient support and adhesion to build upon. Above 45 degrees, support is required to ensure that the newly printed layer does not bulge down and away from the nozzle. Another issue that occurs when printing overhangs is curling. The newly printed layer becomes increasingly thinner at the edge of the overhang, resulting in differential cooling causing it to deform upward.  CORNERS Because the printing nozzle in FDM is circular, corners and edges will have a radius that is equal to the size of the nozzle. This means that these features will never be perfectly square. For sharp edges and corners, the first layers of a print are particularly important. As discussed above for vertical holes, as the nozzle prints each layer, it compresses the print material down to improve adhesion. For the initial print layer, this creates a flare often called an “elephant's foot”. This can impact the ability to assemble FDM parts as this flare protrudes outside the specified dimensions. Another issue that is often present relating to the first print layer of an FDM print is warping. ABS is more vulnerable to warping due to its high printing temperature when compared to PLA. The base layer is the first layer to be printed and cools as the other hot layers are printed on top. This causes differential cooling and can result in the base layer curling up and away from the build plate as it shrinks and contracts. The addition of a chamfer or radius along the edges of the part that are in contact with the build plate will reduce the impact of these problems. This will also assist in removal of the component from the build plate once the print has been completed.  VERTICAL PINS Vertical pins are often printed in FDM when assembly of parts or alignment is required. Considering that these features are often functional, it is important to understand the size of vertical pins that FDM can print accurately. Large pins (greater than 5mm diameter) are printed with a perimeter and infill, affording a strong connection to the rest of the print. Smaller diameter pins (less than 5mm diameter) can be made up of only perimeter prints with no infill. This creates discontinuity between the rest of the print and the pin, resulting in a weak connection that is susceptible to breaking. In a worst case scenario, small pins may not print at all as there is not enough print material for the newly printed layers to adhere to. Often correct printer calibration (optimal layer height, print speed, nozzle temperature etc.) can reduce the likelihood of small pins failing. The addition of a radius at the base of the pin will eliminate that point as a stress concentration and add strength. For critical pins smaller \n\n \n24  \nthan 5mm diameter, an off the shelf pin inserted into a printed hole may be the optimal solution.  ADVANCED DESIGN Several key aspects to consider when printing with FDM are how to reduce the amount of support required, part orientation and the direction the part is built on the build platform. Often, splitting up a model can reduce its complexity, saving on cost and time. Overhangs that require a large amount of support may be removed by simply splitting a complex shape into sections that are printed individually. If desired, the sections can be glued together once the print has been completed.   HOLE ORIENTATION Support for holes is best avoided by changing the print orientation. Removal of support in horizontal axis holes can often be difficult, but by rotating the build direction 90 degrees, the need for support is eliminated. For components with multiple holes in different directions, prioritize blind holes, then holes with the smallest to largest diameter, then criticality of hole size.  BUILD DIRECTION Due to the anisotropic nature of FDM printing, understanding the application of a component and how it is built are critical to the success of a design. FDM components are inherently weaker in one direction due to layer orientation. [27]    7. EXAMPLE In this chapter it is intended to show, by a real example, all the steps to follow for, starting from a model or digital file, getting a real printed piece. The example shown hereunder is about a heritage reproduction project. It arises from the need to make certain pieces of the Museum of Natural History of Valencia accessible to blind people. Specifically, the project is about the lower part of a tiger jaw. The project begins with the 3D scanning of the original jaw, getting a digital model then. This example will begin from this point.  \n\n \n25  \n Figure 12: Digital model, result of the 3D scanning. [28] Whatever it is the file format, it has to be exported to STL, as it has been shown in other chapters of this guide. As it can be seen almost simple sight in the previous Figure, the model has several errors that need to be repaired, like the teeth part, for example. For that, several software can be used. The process of analysis and repairing will be explained here with free-access software. For example: Meshmixer, from Autodesk. Before seeing the process of analysis and reparation of a STL model, it is noted that, this model under consideration was processed by a certain software (Meshlab, specifically) in order to reduce the file size. The model mesh had a very high and excessive number of triangles, so this number was lowed and hence, the file size. This is a step that just a few times is necessary to implement, so it is just mentioned. For further information about how to reduce the number of triangles of a mesh, and hence the size file, the following link is provided: https://www.shapeways.com/tutorials/polygon_reduction_with_meshlab So, as it was said before, the STL model will be opened with Meshmixer, by clicking on Import. The first thing that can be seen is that the model orientation could not be the adequate one. There is no need to be worry about that. Meshmixer allows you to change it by clicking on Edit > Transform. In addition, we will not print by Meshmixer, so orientation has been adjusted approximately, as can be seen here:  \n Figure 13: Positioning the model in Meshmixer. [29] \n\n\n \n26  \nThereupon, a general analysis of the defects of the piece is made. For that, Inspector option is used, in Analysis section. Meshmixer detects and shows all the errors in the model or file. The different mistakes are shown in different colours, and they are shown by balls and arrows. Holes in the mesh are displayed in blue, non-manifold points or edges are displayed in red, and disconnected components or elements with a very little area are displayed in magenta. There are two options now, either repairing the errors one by one by clicking on the \"ball\", or either clicking on Auto Repair All and repairing everything at once.  \n Figure 14: General analysis in Meshmixer. [30] In this case, the software repairs all the found defects automatically. If not, it is possible to use other software and implement other analysis and reparation process. With Meshmixer it is also possible to perform other kind of analysis such as: thickness, stability, orientation and positioning on the printing base, etc. So, at this point, the STL model is completely repaired and it is ready for the next step. As it can be seen, the program has closed every hole in the mesh, and it has repaired all the defects. It is noted that the software does these reparations automatically, trying to get close, more or less, to the geometry around the defect. If holes or gaps in the mesh are intended to be repaired with a certain geometry it is needed to use a digital sculpture software. It is true that Meshmixer has a digital sculpture option, but it will not be explained in this example, because it is not an objective of this guide.  \n\n\n \n27  \n Figure 15: Jaw with repaired holes and defects. [31] So now, in Meshmixer, the repaired and fixed model must be exported or saved again in STL format. The next step is to load the file in a software that allows to do, at least, the following things: - Choosing an orientation in the printing bed. Rotating and moving the model. - Scaling the model. - Choosing the quality or layer height. - Choosing the infill. Density among other issue. - Generating the needed support structures. In addition, with this software the G-Code or machine code will be also generated. There is different free software for doing this. For example, Ultimaker Cura or Slic3r. In this example Cura is used. So, in Cura the repaired model is imported. To configure the software in order to show the printing bed of the machine now is convenient. Cura has a very big data base of commercial 3D printers. If the used machine is not in that data base, it is also possible to create it from scratch. This model is going to be scaled to 60%. 0.2 mm. is the chosen layer quality. A grid infill of 15% density is also chosen. Automatically support structures will be generated everywhere, and in order to get a good adhesion for the first layer, \"first layer speed\" will be set to 20 mm/s. working material is also chosen: PLA. Finally, the G-Code is saved in the device to insert in the printer by clicking on \"Save to File\".  \n Figure 16: Model loaded and configuration and parameters of the model in Cura. [32] \n\n\n \n28  \nAt this point, it is possible to go to the next step of the process: 3D printing itself. It is needed to go to the machine and, by the appropriated means, to launch the print job. The machine will be left working, and it is recommended to see it from time to time in order to see if everything goes correctly. It is important to say that it is highly recommended to check if the first printed layer is correctly stick to the bed or platform. If not, the following guide is provided: https://www.simplify3d.com/support/print-quality-troubleshooting/#print-not-sticking-to-the-bed In the next picture the printing sequence is shown, for the given example:  \n Figure 17: Jaw printing sequence. [33] The next step is, obviously, to extract the printed piece. A spatula with rounded edges is used, in order not to scratch and not to damage the printing platform. Once the piece has been extracted of the platform, it is time for the post-processing step, consisting on manually and mechanically removing the support structures, and sanding those parts of the piece that have marks (from support structures, for example). The printing bed should be correctly cleaned for the next print job... As mentioned, to sand the marks of the support structures, among others, is very convenient. At the end, the final result of the piece is the following one:  \n\n\n \n29  \nFigure 18: Final result. [34]  If the result at any point of the printing process, or at the end of the printing process is not good, or some errors and shrinkages are seen, the following guide can be very helpful, in order to configure some printing parameters or parameters of the printer: https://www.simplify3d.com/support/print-quality-troubleshooting/\t\t\t\t\t\t\t\t\t\t\t\tSOURCES\t\t[1] What is Additive Manufacturing? Source: https://www.3dhubs.com/what-is-3d-printing \nThis\tguide\tis\ta\tsummary\tof\tthe\tdocument\tIO1/A1\tTransfer\tof\tknowledge\tabout\tbasics\tof\t3D\tprinting\tconcepts\tto\tthe\tVET\tTeachers.\t \n\n \n30  \n[2] Scheme 1: Processes and manufacturing techniques. Source: KIT [3] How does 3D printing work? Source: https://www.createeducation.com/about-us/introduction/ [4] Figure 1: 3D printing process. Source: KIT [5] Rapid prototyping technology for the development of new products. 2016. Source: http://ijiset.com/vol3/v3s1/IJISET_V3_I1_39.pdf  [6] Figure 2: FDM Technology. Source: https://i.materialise.com/blog/3d-printing-technologies-and-materials/ [7] F. Kunz, A. A. Jorg, L. Chaabane: Innovation Infrastructure& Services. Switzerland Innovation Park Biel.  2017. [8] FDM Prints. 2017. Source: https://www.sculpteo.com/en/glossary/fdm-fused-deposition-modeling-definition/ [9] Surface modification of fused deposition modeling ABS to enable rapid prototyping of biomedical microdevices. 2013. Source: http://www.sciencedirect.com/science/article/pii/S092401361300006X [10] Scaffold Design and in Vitro Study of Osteochondral Coculture in a Three-Dimensional Porous Polycaprolactone Scaffold Fabricated by Fused Deposition Modeling. 2004. Source: http://online.liebertpub.com/doi/abs/10.1089/10763270360697012 [11] Scheme 2: Production process in 3D printing. Source: CETEM [12] Figure 3: Support structures. Source: https://www.geeky-gadgets.com/wp-content/uploads/2015/01/Form-1-3D-Printer-Update1.jpg  [13] Figure 4: Different types of support structures. Source: http://www.reppersdelight.spacymen.com/public/RD_images/MeshMixer_support3.jpg https://i.ytimg.com/vi/GThbJZZvRFY/maxresdefault.jpg https://www.simufact.com/files/Medien/_2Produkte/2.3_Simufact_Additive/Support-settings_more_support.png [14] Figure 5: Different infill percentages. Source: http://my3dmatter.com/wp-content/uploads/2015/03/infillpercentimage.png https://3dplatform.com/wp-content/uploads/2015/08/3DP-Infill-Percentage-1024x745.jpg Different infill patterns. Source: https://i.ytimg.com/vi/BMWTK2ZgJCM/maxresdefault.jpg https://assets.pinshape.com/uploads/image/file/98145/container_display-tray-for-infill-pattern-and-infill-density-3d-printing-98145.jpg [15] Figure 6: Two different layer heights. Source: http://wiki.ikaslab.org/images/thumb/8/8c/Altura_de_capa.jpg/700px-Altura_de_capa.jpg \n\n[Примечание: документ содержит 31 страниц, обработано 30]",
    "url": "",
    "section": "Документация",
    "problem_type": null,
    "printer_models": [],
    "materials": [],
    "symptoms": [],
    "solutions": [],
    "abstract": "",
    "relevance_score": 0.95,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "D:20190222144507Z00'00'",
    "author": "",
    "images": []
  },
  {
    "id": "7989839056680504352",
    "title": "Как устранить stringing (сопли) при печати PLA",
    "content": "\n            Stringing (сопли) - это проблема, когда между деталями появляются тонкие ниточки пластика.\n            \n            Основные причины:\n            1. Слишком высокая температура экструдера\n            2. Недостаточный retraction\n            3. Слишком медленная скорость печати\n            \n            Решения:\n            1. Уменьшите температуру на 5-10°C\n            2. Увеличьте retraction до 6-8 мм\n            3. Увеличьте скорость retraction до 45-60 мм/с\n            4. Включите функцию \"Coasting\" в настройках слайсера\n            ",
    "url": "https://3dtoday.ru/test/stringing-pla",
    "section": "Техничка",
    "problem_type": "stringing",
    "printer_models": [
      "Ender-3",
      "Ender-3 V2",
      "Ender-3 Pro"
    ],
    "materials": [
      "PLA"
    ],
    "symptoms": [
      "ниточки между деталями",
      "сопли",
      "паутина"
    ],
    "solutions": [
      {
        "parameter": "retraction_length",
        "value": 6,
        "unit": "mm",
        "description": "Увеличьте retraction до 6 мм"
      },
      {
        "parameter": "retraction_speed",
        "value": 45,
        "unit": "mm/s",
        "description": "Скорость retraction 45 мм/с"
      },
      {
        "parameter": "temperature",
        "value": 200,
        "unit": "°C",
        "description": "Уменьшите температуру до 200°C"
      }
    ],
    "abstract": "",
    "relevance_score": 0.95,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "2024-01-15",
    "author": "",
    "images": []
  },
  {
    "id": "8886610556844884571",
    "title": "Как устранить stringing (сопли) при печати PLA",
    "content": "\n            Stringing (сопли) - это проблема, когда между деталями появляются тонкие ниточки пластика.\n            \n            Основные причины:\n            1. Слишком высокая температура экструдера\n            2. Недостаточный retraction\n            3. Слишком медленная скорость печати\n            \n            Решения:\n            1. Уменьшите температуру на 5-10°C\n            2. Увеличьте retraction до 6-8 мм\n            3. Увеличьте скорость retraction до 45-60 мм/с\n            4. Включите функцию \"Coasting\" в настройках слайсера\n            ",
    "url": "https://3dtoday.ru/test/stringing-pla",
    "section": "Техничка",
    "problem_type": "stringing",
    "printer_models": [
      "Ender-3",
      "Ender-3 V2",
      "Ender-3 Pro"
    ],
    "materials": [
      "PLA"
    ],
    "symptoms": [
      "ниточки между деталями",
      "сопли",
      "паутина"
    ],
    "solutions": [
      {
        "parameter": "retraction_length",
        "value": 6,
        "unit": "mm",
        "description": "Увеличьте retraction до 6 мм"
      },
      {
        "parameter": "retraction_speed",
        "value": 45,
        "unit": "mm/s",
        "description": "Скорость retraction 45 мм/с"
      },
      {
        "parameter": "temperature",
        "value": 200,
        "unit": "°C",
        "description": "Уменьшите температуру до 200°C"
      }
    ],
    "abstract": "",
    "relevance_score": 0.95,
    "quality_score": 0.0,
    "content_type": "article",
    "tags": [],
    "date": "2024-01-15",
    "author": "",
    "images": []
  }
]